{
  "en": {
    "image": "https://i.imgur.com/fpMDypS.png",
    "title": "🔧 Version 1.5.7 (176)",
    "text": "1.5.7 (176)\n\nBug Fixes and Improvements\n- Polish added to the app languages list! Thanks to @ciszko on Discord for making this possible!\n- More UI improvements: revamped HP bar, panels with adjusted margins, etc.\n- Item, background, species and spell search dialog boxes now have improved filters and sorting\n- Spells can now have custom Schools of Magic\n- Added a method for Features and Items to modify only the Saving Throws score\n- Notes are now expandable cards\n- Fixed minor bugs"
  },
  "pt": {
    "image": "https://i.imgur.com/fpMDypS.png",
    "title": "🔧 Versão 1.5.7 (176)",
    "text": "1.5.7 (176)\n\nCorreções de bugs e melhorias\n- Polonês adicionado à lista de idiomas do App! Obrigado a @ciszko no Discord por tornar isso possível!\n- Mais melhorias de UI: barra de HP reformulada, painéis com margens ajustadas, etc.\n- Caixas de diálogo de procura de itens, background, species e magias agora têm filtros e ordenações melhoradas\n- Magias podem agora ter Escolas de Magia customizadas\n- Adicionado um método para que Features e Itens modifiquem apenas o valor de Salvaguardas\n- Notes agora são cards expansíveis\n- Correção de pequenos bugs"
  },
  "es": {
    "image": "https://i.imgur.com/fpMDypS.png",
    "title": "🔧 Versión 1.5.7 (176)",
    "text": "1.5.7 (176)\n\nCorrecciones y mejoras\n- ¡Polaco añadido a la lista de idiomas de la app! ¡Gracias a @ciszko en Discord por hacerlo posible!\n- Más mejoras de UI: barra de HP rediseñada, paneles con márgenes ajustados, etc.\n- Los cuadros de diálogo de búsqueda de objetos, background, species y spells ahora tienen filtros y ordenaciones mejoradas\n- Los spells ahora pueden tener Schools of Magic personalizadas\n- Añadido un método para que Features e Items modifiquen solo la puntuación de Saving Throws\n- Las Notes ahora son tarjetas expandibles\n- Corrección de pequeños errores"
  },
  "pl": {
    "image": "https://i.imgur.com/fpMDypS.png",
    "title": "🔧 Wersja 1.5.7 (176)",
    "text": "1.5.7 (176)\n\nPoprawki i ulepszenia\n- Polski dodany do listy języków aplikacji! Dzięki @ciszko na Discord za umożliwienie tego!\n- Więcej ulepszeń UI: przebudowany pasek HP, panele z dostosowanymi marginesami itd.\n- Okna dialogowe wyszukiwania przedmiotów, background, species i zaklęć mają teraz ulepszone filtry i sortowanie\n- Zaklęcia mogą teraz mieć niestandardowe Schools of Magic\n- Dodano metodę, aby Features i Items modyfikowały tylko wynik Saving Throws\n- Notes są teraz rozwijalnymi kartami\n- Naprawiono drobne błędy"
  },
  "Android": "Version 1.5.7 (178)",
  "Ios": "Version 1.5.7 (178)",
  "MacOS": "Version 1.5.7 (178)",
  "Windows": "Version 1.5.7 (178)",
  "Web": "Version 1.5.7 (179)",
  "Linux": "Version 1.5.7 (176)",
  "message": {
    "en": "A new official release is available! Update now for the best experience.",
    "pt": "Uma nova versão oficial está disponível! Atualize agora para a melhor experiência.",
    "es": "¡Hay una nueva versión oficial disponible! Actualiza ahora para la mejor experiencia.",
    "pl": "Dostępne jest nowe oficjalne wydanie! Zaktualizuj teraz, aby uzyskać najlepsze wrażenia."
  },
  "date": "2025-11-19T12:00:00Z"
}