{
  "en": {
    "image": "https://i.imgur.com/RJgiNbe.png",
    "title": "游댢 Version 1.5.5 (168)",
    "text": "1.5.5 (168)\n\n- Fixed how ASIs are selected during Character Creation and when changing Species\n- Changed several dialogs to the new Bottom Modal Sheet pattern\n- Added Campaign Encounter Export/Import\n- Added a dialog when equipping one-handed weapons asking about Main/Off-hand\n- Added toggleable bonuses to Spells so they can be used in the Combat Tab as well\n- Added an Item Randomizer in the Item Search dialog. Set filters and press Randomize!\n- Moved Background Features to the Background card instead of copying them to the Feats list"
  },
  "pt": {
    "image": "https://i.imgur.com/RJgiNbe.png",
    "title": "游댢 Vers칚o 1.5.5 (168)",
    "text": "1.5.5 (168)\n\n- Corrigido como os ASIs s칚o selecionados na Cria칞칚o de Personagem e ao mudar de Esp칠cie\n- Alterados di치logos de alguns locais para o novo padr칚o Bottom Modal Sheet\n- Adicionado Exportar/Importar Encontros de Campanha\n- Adicionado di치logo ao equipar armas com uma m칚o perguntando sobre M칚o Principal/M칚o Secund치ria\n- Adicionados b칪nus ativ치veis em Magias, para que possam ser usados tamb칠m na aba de Combate\n- Adicionado um Randomizador de Itens no di치logo de Busca de Itens. Defina filtros e clique em Aleatorizar!\n- Movidas as Caracter칤sticas de Background para o cart칚o de Background em vez de copi치-las para a lista de Talentos"
  },
  "es": {
    "image": "https://i.imgur.com/RJgiNbe.png",
    "title": "游댢 Versi칩n 1.5.5 (168)",
    "text": "1.5.5 (168)\n\n- Corregido c칩mo se seleccionan los ASI en la Creaci칩n de Personaje y al cambiar de Especie\n- Cambiados los di치logos en algunos lugares al nuevo patr칩n Bottom Modal Sheet\n- A침adido Exportar/Importar Encuentros de Campa침a\n- A침adido un di치logo al equipar armas a una mano preguntando sobre Mano Principal/Mano Secundaria\n- A침adidos bonos activables a los Hechizos, para que tambi칠n puedan usarse en la pesta침a de Combate\n- A침adido un Aleatorizador de 칈tems en el di치logo de B칰squeda de 칈tems. Define filtros y pulsa Aleatorizar!\n- Movidas las Caracter칤sticas de Trasfondo a la tarjeta de Trasfondo en lugar de copiarlas a la lista de Dotes"
  },
  "Android": "Version 1.5.6 (171)",
  "Ios": "Version 1.5.6 (170)",
  "MacOS": "Version 1.5.6 (171)",
  "Windows": "Version 1.5.6 (172)",
  "Web": "Version 1.5.6 (171)",
  "Linux": "Version 1.5.5 (167)",
  "message": {
    "en": "A new official release is available! Update now for the best experience.",
    "pt": "Uma nova vers칚o oficial est치 dispon칤vel! Atualize agora para a melhor experi칡ncia.",
    "es": "춰Hay una nueva versi칩n oficial disponible! Actualiza ahora para la mejor experiencia."
  },
  "date": "2025-11-19T12:00:00Z"
}