{
  "en": {
    "image": "https://i.imgur.com/fzkEQJY.jpeg",
    "title": " Version 1.5.7 (175)",
    "text": "1.5.7 (175)\n\nBug Fixes and Improvements\n- Weight conversion system\n- Toggleable Modifiers now can use Speed as a formula\n- Spells filters now show Full/Partial Matches\n- Rework of Classes Primary Abilities\n- Fixed some typos in some features bonuses\n- Quick Spells reminders now work apart from Toggleable Effects from spells\n- Fixed Spells effects that were not working to give advantage to skills\n- Fixed Numbered Enemies losing its numbers when applying Conditions in the Tracker\n- Adjusted Character Cards for small Screens"
  },
  "pt": {
    "image": "https://i.imgur.com/fzkEQJY.jpeg",
    "title": " Vers茫o 1.5.7 (175)",
    "text": "1.5.7 (175)\n\nCorre莽玫es de bugs e melhorias\n- Sistema de convers茫o de peso\n- Modificadores altern谩veis agora podem usar Velocidade como f贸rmula\n- Filtros de magias agora mostram correspond锚ncias completas/parciais\n- Reestrutura莽茫o das Habilidades Prim谩rias das Classes\n- Corrigidos alguns erros de digita莽茫o em b么nus de caracter铆sticas\n- Lembretes r谩pidos de magias agora funcionam independentemente dos Efeitos Altern谩veis das magias\n- Corrigidos efeitos de magias que n茫o estavam funcionando para dar vantagem em per铆cias\n- Corrigido inimigos numerados perdendo seus n煤meros ao aplicar Condi莽玫es no Rastreador\n- Cards de Personagem ajustados para telas pequenas"
  },
  "es": {
    "image": "https://i.imgur.com/fzkEQJY.jpeg",
    "title": " Versi贸n 1.5.7 (175)",
    "text": "1.5.7 (175)\n\nCorrecciones de errores y mejoras\n- Sistema de conversi贸n de peso\n- Modificadores activables ahora pueden usar Velocidad como f贸rmula\n- Los filtros de hechizos ahora muestran coincidencias completas/parciales\n- Rework de las Habilidades Primarias de las Clases\n- Corregidos algunos errores tipogr谩ficos en bonos de rasgos\n- Los recordatorios r谩pidos de hechizos ahora funcionan aparte de los Efectos Activables de los hechizos\n- Corregidos efectos de hechizos que no estaban funcionando para dar ventaja en habilidades\n- Corregido que los Enemigos numerados perdieran sus n煤meros al aplicar Condiciones en el Tracker\n- Tarjetas de Personaje ajustadas para pantallas peque帽as"
  },
  "pl": {
    "image": "https://i.imgur.com/fzkEQJY.jpeg",
    "title": " Wersja 1.5.7 (175)",
    "text": "1.5.7 (175)\n\nPoprawki i ulepszenia\n- System konwersji wagi\n- Przeczalne modyfikatory mog teraz u偶ywa Szybkoci jako formuy\n- Filtry czar贸w teraz pokazuj dopasowania pene/czciowe\n- Przer贸bka G贸wnych Atrybut贸w Klas\n- Naprawiono kilka liter贸wek w premiach cech\n- Szybkie przypomnienia o czarach teraz dziaaj niezale偶nie od Przeczalnych Efekt贸w czar贸w\n- Naprawiono efekty czar贸w, kt贸re nie dziaay, aby dawa przewag w umiejtnociach\n- Naprawiono, 偶e Numerowani Wrogowie tracili swoje numery po zastosowaniu Kondycji w Trackerze\n- Dostosowano Karty Postaci do maych ekran贸w"
  },
  "Android": "Version 1.5.7 (175)",
  "Ios": "Version 1.5.7 (175)",
  "MacOS": "Version 1.5.7 (175)",
  "Windows": "Version 1.5.7 (175)",
  "Web": "Version 1.5.7 (176)",
  "Linux": "Version 1.5.7 (175)",
  "message": {
    "en": "A new official release is available! Update now for the best experience.",
    "pt": "Uma nova vers茫o oficial est谩 dispon铆vel! Atualize agora para a melhor experi锚ncia.",
    "es": "隆Hay una nueva versi贸n oficial disponible! Actualiza ahora para la mejor experiencia.",
    "pl": "Dostpne jest nowe oficjalne wydanie! Zaktualizuj teraz, aby uzyska najlepsze wra偶enia."
  },
  "date": "2025-11-19T12:00:00Z"
}