{
  "en": {
    "image": "https://i.imgur.com/c3Ap8XV.png",
    "title": "🔧 Version 1.5.6 (173)",
    "text": "1.5.6 (173)\n\n- Changed Item Search Dialog: sorts by Price by default, supports multi-word search\n- Species can now have attached Features (Racial modifiers). XML Import creates \"(Species Name) Traits\"\n- Revamped Class Cards and removed HP Card from Attributes Page\n- Adding spells no longer asks if it has Attack Rolls (detected on XML Import, English only)\n- Fullscreen mode for mobile\n- Adjusted more dialogs to bottom dialogs\n- Fixed Item Charges issues and a breaking bug when changing Features from Classes\n- Fixed minor bug in short rest hit rolls with +0 CON"
  },
  "pt": {
    "image": "https://i.imgur.com/c3Ap8XV.png",
    "title": "🔧 Versão 1.5.6 (173)",
    "text": "1.5.6 (173)\n\n- Alterado o Diálogo de Busca de Itens: ordena por Preço por padrão, suporta busca por múltiplas palavras\n- Espécies agora podem ter Características anexadas (modificadores Raciais). Importação XML cria \"Traços de (Nome da Espécie)\"\n- Cartões de Classe renovados e removido o Cartão de PV da Página de Atributos\n- Adicionar magias não pergunta mais se possui Jogadas de Ataque (detectado na Importação XML, apenas em Inglês)\n- Modo tela cheia para mobile\n- Mais diálogos ajustados para o padrão inferior (bottom dialogs)\n- Corrigidos problemas com Cargas de Itens e um erro crítico ao alterar Características de Classes\n- Corrigido erro menor em rolagens de descanso curto com modificador de CON +0"
  },
  "es": {
    "image": "https://i.imgur.com/c3Ap8XV.png",
    "title": "🔧 Versión 1.5.6 (173)",
    "text": "1.5.6 (173)\n\n- Cambiado el Diálogo de Búsqueda de Ítems: ordena por Precio por defecto, soporta búsqueda de múltiples palabras\n- Las Especies ahora pueden tener Características adjuntas (modificadores Raciales). La importación XML crea \"Rasgos de (Nombre de Especie)\"\n- Tarjetas de Clase renovadas y eliminada la Tarjeta de PV de la Página de Atributos\n- Añadir hechizos ya no pregunta si tiene Tiradas de Ataque (detectado en la Importación XML, solo en Inglés)\n- Modo pantalla completa para móviles\n- Más diálogos ajustados al patrón inferior (bottom dialogs)\n- Corregidos problemas con Cargas de Ítems y un error crítico al cambiar Características de Clases\n- Corregido error menor en tiradas de descanso corto con modificador de CON +0"
  },
  "Android": "Version 1.5.6 (174)",
  "Ios": "Version 1.5.6 (173)",
  "MacOS": "Version 1.5.6 (173)",
  "Windows": "Version 1.5.6 (173)",
  "Web": "Version 1.5.6 (174)",
  "Linux": "Version 1.5.5 (167)",
  "message": {
    "en": "A new official release is available! Update now for the best experience.",
    "pt": "Uma nova versão oficial está disponível! Atualize agora para a melhor experiência.",
    "es": "¡Hay una nueva versión oficial disponible! Actualiza ahora para la mejor experiencia."
  },
  "date": "2025-11-19T12:00:00Z"
}