{
  "en": {
    "image": "https://i.imgur.com/t1FX1ie.png",
    "title": "🔧 Version 1.5.8 (188)",
    "text": "1.5.8 (188)\n\n(WARNING) New Equipment System!\n- Items can now be equipped in a new equipment system designed to make it more intuitive and understandable what is or isn't equipped. Access your inventory and re-equip your items so that available slots are shown. WARNING: From this version on, some crucial data has been modified, so characters opened now will not be compatible with previous versions of the app (e.g. 1.5.7). If you have sync enabled, an error when syncing with an old version is normal. Thanks to Evan on Discord for creating the icons.\n\n- Transformations! Are you a druid or want to be polymorphed? Just add a creature in the Transformations submenu of the HP Card!\n\n- Bug fix for monsters: Attacks were being imported incorrectly. To apply the fix, simply re-import your favorite XML file.\n\n- Many, many minor fixes. Full list can be found on Discord."
  },
  "pt": {
    "image": "https://i.imgur.com/t1FX1ie.png",
    "title": "🔧 Versão 1.5.8 (188)",
    "text": "1.5.8 (188)\n\n(AVISO) Novo sistema de Equipamentos!\n- Agora os itens podem ser equipados em um novo sistema de equipamentos que foi criado para deixar mais intuitivo e compreensível o que está ou não equipado. Acesse seu inventário e equipe seus itens novamente, para que seja mostrado quais slots estão disponíveis. CUIDADO: A partir dessa versão, alguns dados cruciais foram modificados, então os personagens abertos agora não serão compatíveis com versões anteriores do app (1.5.7 por exemplo). Se você tem o sync ativado, é normal um erro ao fazer a sincronização com uma versão antiga. Agradecimentos ao Evan no Discord por criar os ícones.\n\n- Transformações! É um druida ou quer ser polimorfado? Basta adicionar uma criatura no submenu Transformations do Card de HP!\n\n- Bug corrigido sobre os monstros: os ataques estavam sendo importados incorretamente. Para que a correção seja feita, basta reimportar o seu arquivo XML favorito.\n\n- Muitos, muitos minor fixes. Pode ser encontrado completo no Discord."
  },
  "es": {
    "image": "https://i.imgur.com/t1FX1ie.png",
    "title": "🔧 Versión 1.5.8 (188)",
    "text": "1.5.8 (188)\n\n(AVISO) ¡Nuevo sistema de Equipamiento!\n- Ahora los objetos pueden equiparse en un nuevo sistema de equipamiento diseñado para que sea más intuitivo y comprensible qué está o no equipado. Accede a tu inventario y vuelve a equipar tus objetos para que se muestren qué ranuras están disponibles. CUIDADO: A partir de esta versión, se han modificado algunos datos cruciales, por lo que los personajes abiertos ahora no serán compatibles con versiones anteriores de la aplicación (1.5.7 por ejemplo). Si tienes la sincronización activada, es normal que ocurra un error al sincronizar con una versión antigua. Gracias a Evan en Discord por crear los iconos.\n\n- ¡Transformaciones! ¿Eres un druida o quieres ser polimorfado? ¡Solo añade una criatura en el submenú Transformations de la Tarjeta de HP!\n\n- Corrección de error en monstruos: Los ataques se importaban incorrectamente. Para aplicar la corrección, simplemente reimporta tu archivo XML favorito.\n\n- Muchos, muchos arreglos menores. La lista completa se puede encontrar en Discord."
  },
  "pl": {
    "image": "https://i.imgur.com/t1FX1ie.png",
    "title": "🔧 Wersja 1.5.8 (188)",
    "text": "1.5.8 (188)\n\n(OSTRZEŻENIE) Nowy System Ekwipunku!\n- Przedmioty mogą być teraz wyposażane w nowym systemie ekwipunku, zaprojektowanym tak, aby było bardziej intuicyjne i zrozumiale co jest, a co nie jest wyposażone. Uzyskaj dostęp do swojego ekwipunku i wyposaż swoje przedmioty ponownie, aby pokazać dostępne sloty. UWAGA: Od tej wersji zmodyfikowano niektóre kluczowe dane, więc postacie otwarte teraz nie będą kompatybilne z poprzednimi wersjami aplikacji (np. 1.5.7). Jeśli masz włączoną synchronizację, błąd podczas synchronizacji ze starszą wersją jest normalny. Podziękowania dla Evana na Discordzie za stworzenie ikon.\n\n- Transformacje! Jesteś druidem lub chcesz zostać polimorfowany? Po prostu dodaj stworzenie w podmenu Transformations na karcie PŻ!\n\n- Naprawiono błąd z potworami: Ataki były importowane nieprawidłowo. Aby zastosować poprawkę, po prostu zaimportuj ponownie swój ulubiony plik XML.\n\n- Wiele, wiele drobnych poprawek. Pełną listę można znaleźć na Discordzie."
  },
  "it": {
    "image": "https://i.imgur.com/t1FX1ie.png",
    "title": "🔧 Versione 1.5.8 (188)",
    "text": "1.5.8 (188)\n\n(AVVISO) Nuovo Sistema di Equipaggiamento!\n- Gli oggetti possono ora essere equipaggiati in un nuovo sistema di equipaggiamento progettato per rendere più intuitivo e comprensibile cosa è o non è equipaggiato. Accedi al tuo inventario ed equipaggia nuovamente i tuoi oggetti in modo che vengano mostrati gli slot disponibili. ATTENZIONE: Da questa versione in poi, alcuni dati cruciali sono stati modificati, quindi i personaggi aperti ora non saranno compatibili con le versioni precedenti dell'app (es. 1.5.7). Se hai la sincronizzazione attiva, è normale un errore durante la sincronizzazione con una vecchia versione. Grazie a Evan su Discord per aver creato le icone.\n\n- Trasformazioni! Sei un druido o vuoi essere polimorfato? Aggiungi una creatura nel sottomenu Transformations della Scheda HP!\n\n- Corretto bug sui mostri: Gli attacchi venivano importati in modo errato. Per applicare la correzione, basta reimportare il tuo file XML preferito.\n\n- Molti, molti piccoli fix. L'elenco completo si trova su Discord."
  },
  "Android": "Version 1.5.7 (187)",
  "Ios": "Version 1.5.7 (187)",
  "MacOS": "Version 1.5.7 (187)",
  "Windows": "Version 1.5.7 (187)",
  "Web": "Version 1.5.7 (187)",
  "Linux": "Version 1.5.7 (176)",
  "message": {
    "en": "A new official release is available! Update now for the best experience.",
    "pt": "Uma nova versão oficial está disponível! Atualize agora para a melhor experiência.",
    "es": "¡Hay una nueva versión oficial disponible! Actualiza ahora para la mejor experiencia.",
    "pl": "Dostępne jest nowe oficjalne wydanie! Zaktualizuj teraz, aby uzyskać najlepsze wrażenia.",
    "it": "È disponibile una nuova versione ufficiale! Aggiorna ora per la migliore esperienza."
  },
  "date": "2026-02-06T12:00:00Z"
}