{
    "en": {
        "image": "https://i.imgur.com/swOmD0K.png",
        "title": "CharacterCraft 5.5e – Official Launch",
        "text": "We are proud to announce the official launch of CharacterCraft 5.5e, the ultimate tool for RPG players to create, manage, and share their characters with ease. Initially available in three languages—English, Portuguese, and Spanish—with more coming in future updates, this app is designed to help you bring your RPG adventures to life.\n\nKey Features:\n- Intuitive Multi-Language Interface: A guided, step-by-step character creation process available in English, Portuguese, and Spanish.\n- Comprehensive Character Management: Organize and access all your character information quickly and efficiently.\n- Simple Import and Export: Easily share your characters and homebrew content via JSON or XML files.\n- Clear JSON File Structure: Perfect for content creators looking to customize and expand their libraries.\n- Integrated Initiative Tracker: Add characters and monsters swiftly to enhance game flow during crucial moments.\n- Built-in Dice Roller: Automate attack rolls to reduce manual calculations and save time.\n- Customizable Organization: Rearrange feats and equipment with a simple swipe to prioritize what matters most.\n\nMultiplatform Availability:\nCharacterCraft 5.5e is currently available for Android and Windows, with plans to bring it to iOS and Mac as soon as possible.\n\nWhile this initial release might still have a few minor bugs, your feedback is essential as we work toward a more polished version 1.0.\n\nSupport the Project:\nIf you enjoy using CharacterCraft 5.5e and want to see it grow even further, please consider making a donation. Your generous support helps cover development and server costs. Additionally, join our Discord community to share your ideas, report issues, and connect with fellow RPG enthusiasts.\n\nThank you for being a part of this journey. We look forward to enhancing your RPG adventures with every update.\n\nWelcome to a new era of character creation. Enjoy the adventure!"
    },
    "pt": {
        "image": "https://i.imgur.com/swOmD0K.png",
        "title": "CharacterCraft 5.5e – Lançamento Oficial",
        "text": "Temos o orgulho de anunciar o lançamento oficial do CharacterCraft 5.5e, a ferramenta definitiva para jogadores de RPG criarem, gerenciarem e compartilharem seus personagens com facilidade. Inicialmente disponível em três idiomas—Inglês, Português e Espanhol—com mais idiomas em atualizações futuras, este aplicativo foi projetado para ajudar você a dar vida às suas aventuras de RPG.\n\nRecursos Principais:\n- Interface Multi-idiomas Intuitiva: Um processo guiado passo a passo para criação de personagens disponível em Inglês, Português e Espanhol.\n- Gerenciamento Abrangente de Personagens: Organize e acesse todas as informações do seu personagem de forma rápida e eficiente.\n- Importação e Exportação Simples: Compartilhe facilmente seus personagens e conteúdo homebrew via arquivos JSON ou XML.\n- Estrutura Clara de Arquivos JSON: Perfeita para criadores de conteúdo que desejam personalizar e expandir suas bibliotecas.\n- Rastreador de Iniciativa Integrado: Adicione personagens e monstros rapidamente para melhorar o fluxo do jogo durante momentos cruciais.\n- Rolador de Dados Integrado: Automatize rolagens de ataque para reduzir cálculos manuais e economizar tempo.\n- Organização Personalizável: Reorganize poderes e equipamentos com um simples deslize para priorizar o que é mais importante.\n\nDisponibilidade Multiplataforma:\nO CharacterCraft 5.5e está atualmente disponível para Android e Windows, com planos para trazê-lo para iOS e Mac o mais rápido possível.\n\nEmbora este lançamento inicial ainda possa ter alguns pequenos bugs, seu feedback é essencial enquanto trabalhamos em direção a uma versão 1.0 mais refinada.\n\nApoie o Projeto:\nSe você gosta de usar o CharacterCraft 5.5e e quer vê-lo crescer ainda mais, considere fazer uma doação. Seu generoso apoio ajuda a cobrir os custos de desenvolvimento e servidores. Além disso, junte-se à nossa comunidade no Discord para compartilhar suas ideias, relatar problemas e se conectar com outros entusiastas de RPG.\n\nObrigado por fazer parte desta jornada. Esperamos melhorar suas aventuras de RPG com cada atualização.\n\nBem-vindo a uma nova era de criação de personagens. Aproveite a aventura!"
    },
    "es": {
        "image": "https://i.imgur.com/swOmD0K.png",
        "title": "CharacterCraft 5.5e – Lanzamiento Oficial",
        "text": "Nos enorgullece anunciar el lanzamiento oficial de CharacterCraft 5.5e, la herramienta definitiva para que los jugadores de RPG creen, gestionen y compartan sus personajes con facilidad. Inicialmente disponible en tres idiomas—inglés, portugués y español—con más por venir en futuras actualizaciones, esta aplicación está diseñada para ayudarte a dar vida a tus aventuras de RPG.\n\nCaracterísticas Principales:\n- Interfaz Multilingüe Intuitiva: Un proceso guiado paso a paso para la creación de personajes disponible en inglés, portugués y español.\n- Gestión Integral de Personajes: Organiza y accede a toda la información de tu personaje de forma rápida y eficiente.\n- Importación y Exportación Sencillas: Comparte fácilmente tus personajes y contenido casero mediante archivos JSON o XML.\n- Estructura Clara de Archivos JSON: Perfecta para creadores de contenido que desean personalizar y ampliar sus bibliotecas.\n- Seguimiento de Iniciativa Integrado: Añade personajes y monstruos rápidamente para mejorar el flujo del juego durante momentos cruciales.\n- Lanzador de Dados Incorporado: Automatiza tiradas de ataque para reducir cálculos manuales y ahorrar tiempo.\n- Organización Personalizable: Reorganiza habilidades y equipamiento con un simple deslizamiento para priorizar lo que es más importante.\n\nDisponibilidad Multiplataforma:\nCharacterCraft 5.5e está actualmente disponible para Android y Windows, con planes para llevarlo a iOS y Mac lo antes posible.\n\nAunque este lanzamiento inicial aún puede tener algunos pequeños errores, tus comentarios son esenciales mientras trabajamos hacia una versión 1.0 más pulida.\n\nApoya el Proyecto:\nSi disfrutas usando CharacterCraft 5.5e y quieres verlo crecer aún más, considera hacer una donación. Tu generoso apoyo ayuda a cubrir los costos de desarrollo y servidores. Además, únete a nuestra comunidad de Discord para compartir tus ideas, informar problemas y conectar con otros entusiastas de RPG.\n\nGracias por ser parte de este viaje. Esperamos mejorar tus aventuras de RPG con cada actualización.\n\n¡Bienvenido a una nueva era de creación de personajes. ¡Disfruta la aventura!"
    },
    "date": "2025-04-10T12:00:00Z"
}