{
  "en": {
    "image": "https://i.imgur.com/fzkEQJY.jpeg",
    "title": "🔧 Version 1.5.7 (175)",
    "text": "1.5.7 (175)\n\nBug Fixes and Improvements\n- Weight conversion system\n- Toggleable Modifiers now can use Speed as a formula\n- Spells filters now show Full/Partial Matches\n- Rework of Classes Primary Abilities\n- Fixed some typos in some features bonuses\n- Quick Spells reminders now work apart from Toggleable Effects from spells\n- Fixed Spells effects that were not working to give advantage to skills\n- Fixed Numbered Enemies losing its numbers when applying Conditions in the Tracker\n- Adjusted Character Cards for small Screens"
  },
  "pt": {
    "image": "https://i.imgur.com/fzkEQJY.jpeg",
    "title": "🔧 Versão 1.5.7 (175)",
    "text": "1.5.7 (175)\n\nCorreções de bugs e melhorias\n- Sistema de conversão de peso\n- Modificadores alternáveis agora podem usar Velocidade como fórmula\n- Filtros de magias agora mostram correspondências completas/parciais\n- Reestruturação das Habilidades Primárias das Classes\n- Corrigidos alguns erros de digitação em bônus de características\n- Lembretes rápidos de magias agora funcionam independentemente dos Efeitos Alternáveis das magias\n- Corrigidos efeitos de magias que não estavam funcionando para dar vantagem em perícias\n- Corrigido inimigos numerados perdendo seus números ao aplicar Condições no Rastreador\n- Cards de Personagem ajustados para telas pequenas"
  },
  "es": {
    "image": "https://i.imgur.com/fzkEQJY.jpeg",
    "title": "🔧 Versión 1.5.7 (175)",
    "text": "1.5.7 (175)\n\nCorrecciones de errores y mejoras\n- Sistema de conversión de peso\n- Modificadores activables ahora pueden usar Velocidad como fórmula\n- Los filtros de hechizos ahora muestran coincidencias completas/parciales\n- Rework de las Habilidades Primarias de las Clases\n- Corregidos algunos errores tipográficos en bonos de rasgos\n- Los recordatorios rápidos de hechizos ahora funcionan aparte de los Efectos Activables de los hechizos\n- Corregidos efectos de hechizos que no estaban funcionando para dar ventaja en habilidades\n- Corregido que los Enemigos numerados perdieran sus números al aplicar Condiciones en el Tracker\n- Tarjetas de Personaje ajustadas para pantallas pequeñas"
  },
  "Android": "Version 1.5.7 (175)",
  "Ios": "Version 1.5.6 (174)",
  "MacOS": "Version 1.5.6 (174)",
  "Windows": "Version 1.5.6 (174)",
  "Web": "Version 1.5.7 (175)",
  "Linux": "Version 1.5.7 (175)",
  "message": {
    "en": "A new official release is available! Update now for the best experience.",
    "pt": "Uma nova versão oficial está disponível! Atualize agora para a melhor experiência.",
    "es": "¡Hay una nueva versión oficial disponible! Actualiza ahora para la mejor experiencia."
  },
  "date": "2025-11-19T12:00:00Z"
}