{
    "en": {
        "image": "https://i.imgur.com/swOmD0K.png",
        "title": "Welcome to CharacterCraft!",
        "text": "🚀Introducing Character Craft 5.5e, the ultimate solution for RPG players seeking a modern and efficient tool for character creation and management.\n\nKey Features:\n\nIntuitive Multi-Language Interface: Enjoy a guided, step-by-step character creation process available in multiple languages.\n\nComprehensive Character Management: Easily organize and access all your character information.\n\nSimple Import and Export: Share your characters and homebrew content with friends via JSON or XML files.\n\nClear JSON File Structure: Ideal for content creators looking to customize and expand their libraries.\n\nIntegrated Initiative Tracker: Quickly add characters and monsters to streamline gameplay during crucial moments.\n\nBuilt-in Dice Roller: Automate attack rolls, saving time and reducing manual calculations.\n\nCustomizable Organization: Rearrange feats and equipment with a simple swipe, prioritizing what's most important to you.\n\nWhile this is the initial release and some bugs may be present, your support is essential for us to continually improve the app until we reach version 1.0. Thank you for joining us on this journey, and we hope Character Craft 5.5e enhances your RPG adventures."
    },
    "pt": {
        "image": "https://i.imgur.com/swOmD0K.png",
        "title": "Bem-vindo ao CharacterCraft!",
        "text": "🚀Apresentando o Character Craft 5.5e, a solução definitiva para jogadores de RPG que buscam uma ferramenta moderna e eficiente para criação e gerenciamento de personagens.\n\nRecursos Principais:\n\nInterface Multi-Idiomas Intuitiva: Aproveite um processo de criação de personagem guiado e passo a passo disponível em vários idiomas.\n\nGerenciamento Abrangente de Personagens: Organize e acesse facilmente todas as informações do seu personagem.\n\nImportação e Exportação Simples: Compartilhe seus personagens e conteúdo homebrew com amigos através de arquivos JSON ou XML.\n\nEstrutura Clara de Arquivos JSON: Ideal para criadores de conteúdo que desejam personalizar e expandir suas bibliotecas.\n\nRastreador de Iniciativa Integrado: Adicione rapidamente personagens e monstros para agilizar a jogabilidade durante momentos cruciais.\n\nRolador de Dados Integrado: Automatize rolagens de ataque, economizando tempo e reduzindo cálculos manuais.\n\nOrganização Personalizável: Reorganize poderes e equipamentos com um simples deslize, priorizando o que é mais importante para você.\n\nEmbora esta seja a versão inicial e alguns bugs possam estar presentes, seu apoio é essencial para que possamos melhorar continuamente o aplicativo até chegarmos à versão 1.0. Obrigado por se juntar a nós nesta jornada, e esperamos que o Character Craft 5.5e aprimore suas aventuras de RPG."
    },
    "es": {
        "image": "https://i.imgur.com/swOmD0K.png",
        "title": "¡Bienvenido a CharacterCraft!",
        "text": "🚀Presentamos Character Craft 5.5e, la solución definitiva para jugadores de RPG que buscan una herramienta moderna y eficiente para la creación y gestión de personajes.\n\nCaracterísticas Principales:\n\nInterfaz Multilingüe Intuitiva: Disfruta de un proceso guiado paso a paso para la creación de personajes disponible en varios idiomas.\n\nGestión Integral de Personajes: Organiza y accede fácilmente a toda la información de tu personaje.\n\nImportación y Exportación Sencillas: Comparte tus personajes y contenido casero con amigos mediante archivos JSON o XML.\n\nEstructura Clara de Archivos JSON: Ideal para creadores de contenido que desean personalizar y ampliar sus bibliotecas.\n\nSeguimiento de Iniciativa Integrado: Añade rápidamente personajes y monstruos para agilizar el juego durante momentos cruciales.\n\nLanzador de Dados Incorporado: Automatiza tiradas de ataque, ahorrando tiempo y reduciendo cálculos manuales.\n\nOrganización Personalizable: Reorganiza habilidades y equipamiento con un simple deslizamiento, priorizando lo que es más importante para ti.\n\nAunque esta es la versión inicial y pueden existir algunos errores, tu apoyo es esencial para que podamos mejorar continuamente la aplicación hasta alcanzar la versión 1.0. Gracias por unirte a nosotros en este viaje, y esperamos que Character Craft 5.5e mejore tus aventuras de RPG."
    },
    "date": "2025-04-10T12:00:00Z"
}