{"name":"Template Barbarian","species":{"id":"aasimar","name":"Aasimar","description":"Aasimar (pronounced AH-sih-mar) are mortals who carry a spark of the Upper Planes within their souls. Whether descended from an angelic being or infused with celestial power, they can fan that spark to bring light, healing, and heavenly fury.\n\nAasimar can arise among any population of mortals. They resemble their parents, but they live for up to 160 years and have features that hint at their celestial heritage, such as metallic freckles, luminous eyes, a halo, or the skin color of an angel (silver, opalescent green, or coppery red). These features start subtle and become obvious when the aasimar learns to reveal their full celestial nature.\n\nSource:\tPlayer's Handbook 2024 p. 186","size":"Medium","speed":"30 ft.","traits":[{"name":"Creature Type","description":"Humanoid"},{"name":"Size","description":"Medium (about 4-7 feet tall) or Small (about 2-4 feet tall), chosen when you select this species"},{"name":"Celestial Resistance","description":"You have Resistance to Necrotic damage and Radiant damage."},{"name":"Darkvision","description":"You have Darkvision with a range of 60 feet."},{"name":"Healing Hands","description":"As a Magic action, you touch a creature and roll a number of d4s equal to your Proficiency Bonus. The creature regains a number of Hit Points equal to the total rolled. Once you use this trait, you can't use it again until you finish a Long Rest."},{"name":"Light Bearer","description":"You know the Light cantrip. Charisma is your spellcasting ability for it."},{"name":"Celestial Revelation","description":"When you reach character level 3, you can transform as a Bonus Action using one of the options below (choose the option each time you transform). The transformation lasts for 1 minute or until you end it (no action required). Once you transform, you can't do so again until you finish a Long Rest.\n\nOnce on each of your turns before the transformation ends, you can deal extra damage to one target when you deal damage to it with an attack or a spell. The extra damage equals your Proficiency Bonus, and the extra damage's type is either Necrotic for Necrotic Shroud or Radiant for Heavenly Wings and Inner Radiance.\n\nHere are the transformation options:\n\nHeavenly Wings:\nTwo spectral wings sprout from your back temporarily. Until the transformation ends, you have a Fly Speed equal to your Speed.\n\nInner Radiance:\nSearing light temporarily radiates from your eyes and mouth. For the duration, you shed Bright Light in a 10-foot radius and Dim Light for an additional 10 feet, and at the end of each of your turns, each creature within 10 feet of you takes Radiant damage equal to your Proficiency Bonus.\n\nNecrotic Shroud:\nYour eyes briefly become pools of darkness, and flightless wings sprout from your back temporarily. Creatures other than your allies within 10 feet of you must succeed on a Charisma saving throw (DC 8 plus your Charisma modifier and Proficiency Bonus) or have the Frightened condition until the end of your next turn."}],"abilityScores":[""],"proficiency":[],"spellAbility":"","source":null},"class":[{"id":"barbarian}","name":"Barbarian","source":"Unknown","description":"Barbarians are mighty warriors who are powered by primal forces of the multiverse that manifest as a Rage. More than a mere emotion—and not limited to anger—this Rage is an incarnation of a predator's ferocity, a storm's fury, and a sea's turmoil.\n\nSome Barbarians personify their Rage as a fierce spirit or revered forebear. Others see it as a connection to the pain and anguish of the world, as an impersonal tangle of wild magic, or as an expression of their own deepest self. For every Barbarian, their Rage is a power that fuels not just battle prowess, but also uncanny reflexes and heightened senses.\n\nBarbarians often serve as protectors and leaders in their communities. They charge headlong into danger so those under their protection don't have to. Their courage in the face of danger makes Barbarians perfectly suited for adventure.\n\nSource:\tPlayer's Handbook 2024 p. 51","primaryAbility":"Strength","hitPointDie":"1d12","hitPointsAtLevel1":"12 + Constitution","hitPointsPerLevel":"1d12 + Constitution or 7 + Constitution","savingThrowProficiencies":["Strength","Constitution"],"skillProficiencies":["Animal Handling","Athletics","Intimidation","Nature","Perception","Survival"],"weaponProficiencies":"Simple Weapons, Martial Weapons","armorTraining":"Light Armor, Medium Armor, Shields","startingEquipmentOptions":["Greataxe, 4 Handaxes, Explorer's Pack, and 15 GP","75 GP"],"level":1,"numberOfSkills":2,"multiclassNumberOfSkills":0,"multiclassWeaponProficiencies":"Martial Weapons","multiclassArmorTraining":"Shields","spellcastingMultiplier":1.0,"spellAbility":"","classFeatures":{"1":[{"id":"Barbarian_Barbarian","name":"Barbarian","description":"Barbarians are mighty warriors who are powered by primal forces of the multiverse that manifest as a Rage. More than a mere emotion—and not limited to anger—this Rage is an incarnation of a predator's ferocity, a storm's fury, and a sea's turmoil.\n\nSome Barbarians personify their Rage as a fierce spirit or revered forebear. Others see it as a connection to the pain and anguish of the world, as an impersonal tangle of wild magic, or as an expression of their own deepest self. For every Barbarian, their Rage is a power that fuels not just battle prowess, but also uncanny reflexes and heightened senses.\n\nBarbarians often serve as protectors and leaders in their communities. They charge headlong into danger so those under their protection don't have to. Their courage in the face of danger makes Barbarians perfectly suited for adventure.\n\nSource:\tPlayer's Handbook 2024 p. 51","type":"Barbarian Class Feature","prerequisiteList":[]},{"id":"Level 1: Rage_Barbarian","name":"Level 1: Rage","description":"You can imbue yourself with a primal power called Rage, a force that grants you extraordinary might and resilience. You can enter it as a Bonus Action if you aren't wearing Heavy armor.\n\nYou can enter your Rage the number of times shown for your Barbarian level in the Rages column of the Barbarian Features table. You regain one expended use when you finish a Short Rest, and you regain all expended uses when you finish a Long Rest.\n\nWhile active, your Rage follows the rules below.\n\nDamage Resistance:\nYou have Resistance to Bludgeoning, Piercing, and Slashing damage.\n\nRage Damage:\nWhen you make an attack using Strength- with either a weapon or an Unarmed Strike- and deal damage to the target, you gain a bonus to the damage that increases as you gain levels as a Barbarian, as shown in the Rage Damage column of the Barbarian Features table (+2 at 1st level, +3 at 9th level, +4 at 16th level).\n\nStrength Advantage:\nYou have Advantage on Strength checks and Strength saving throws.\n\nNo Concentration or Spells:\nYou can't maintain Concentration, and you can't cast spells.\n\nDuration:\nThe Rage lasts until the end of your next turn, and it ends early if you don Heavy armor or have the Incapacitated condition. If your Rage is still active on your next turn, you can extend the Rage for another round by doing one of the following:\n\n\t• Make an attack roll against an enemy.\n\t• Force an enemy to make a saving throw.\n\t• Take a Bonus Action to extend your Rage.\n\nEach time the Rage is extended, it lasts until the end of your next turn. You can maintain a Rage for up to 10 minutes.\n\nSource:\tPlayer's Handbook 2024 p. 51","type":"Barbarian Class Feature","prerequisiteList":[],"customFields":{"Rage":{"recovery":{"shortRest":"0","longRest":"1"},"1":2,"3":3,"6":4,"12":5,"17":6}}},{"id":"Level 1: Unarmored Defense_Barbarian","name":"Level 1: Unarmored Defense","description":"While you aren't wearing any armor, your base Armor Class equals 10 plus your Dexterity and Constitution modifiers. You can use a Shield and still gain this benefit.\n\nSource:\tPlayer's Handbook 2024 p. 51","type":"Barbarian Class Feature","prerequisiteList":[]},{"id":"Level 1: Weapon Mastery_Barbarian","name":"Level 1: Weapon Mastery","description":"Your training with weapons allows you to use the mastery properties of two kinds of Simple or Martial Melee weapons of your choice, such as Greataxes and Handaxes. Whenever you finish a Long Rest, you can practice weapon drills and change one of those weapon choices.\n\nWhen you reach certain Barbarian levels, you gain the ability to use the mastery properties of more kinds of weapons, as shown in the Weapon Mastery column of the Barbarian Features table. (2 at level 2, 3 at level 4, 4 at level 10)\n\nSource:\tPlayer's Handbook 2024 p. 52","type":"Barbarian Class Feature","prerequisiteList":[]}],"2":[{"id":"Level 2: Danger Sense_Barbarian","name":"Level 2: Danger Sense","description":"You gain an uncanny sense of when things aren't as they should be, giving you an edge when you dodge perils. You have Advantage on Dexterity saving throws unless you have the Incapacitated condition.\n\nSource:\tPlayer's Handbook 2024 p. 52","type":"Barbarian Class Feature","prerequisiteList":[]},{"id":"Level 2: Reckless Attack_Barbarian","name":"Level 2: Reckless Attack","description":"You can throw aside all concern for defense to attack with increased ferocity. When you make your first attack roll on your turn, you can decide to attack recklessly. Doing so gives you Advantage on attack rolls using Strength until the start of your next turn, but attack rolls against you have Advantage during that time.\n\nSource:\tPlayer's Handbook 2024 p. 52","type":"Barbarian Class Feature","prerequisiteList":[]}],"3":[{"id":"Level 3: Barbarian Subclass_Barbarian","name":"Level 3: Barbarian Subclass","description":"You gain a Barbarian subclass of your choice. The Path of the Berserker, Path of the Wild Heart, Path of the World Tree, and Path of the Zealot subclasses are detailed after this class's description. A subclass is a specialization that grants you features at certain Barbarian levels. For the rest of your career, you gain each of your subclass's features that are of your Barbarian level or lower.\n\nSource:\tPlayer's Handbook 2024 p. 52","type":"Barbarian Class Feature","prerequisiteList":[]},{"id":"Level 3: Primal Knowledge_Barbarian","name":"Level 3: Primal Knowledge","description":"You gain proficiency in another skill of your choice from the skill list available to Barbarians at level 1.\n\nIn addition, while your Rage is active, you can channel primal power when you attempt certain tasks; whenever you make an ability check using one of the following skills, you can make it as a Strength check even if it normally uses a different ability: Acrobatics, Intimidation, Perception, Stealth, or Survival. When you use this ability, your Strength represents primal power coursing through you, honing your agility, bearing, and senses.\n\nSource:\tPlayer's Handbook 2024 p. 52","type":"Barbarian Class Feature","prerequisiteList":[]}],"4":[{"id":"Level 4: Ability Score Improvement_Barbarian","name":"Level 4: Ability Score Improvement","description":"You gain the Ability Score Improvement feat (see chapter 5) or another feat of your choice for which you qualify. You gain this feature again at Barbarian levels 8, 12, and 16.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisiteList":[]}],"5":[{"id":"Level 5: Extra Attack_Barbarian","name":"Level 5: Extra Attack","description":"You can attack twice instead of once whenever you take the Attack action on your turn.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisiteList":[]},{"id":"Level 5: Fast Movement_Barbarian","name":"Level 5: Fast Movement","description":"Your speed increases by 10 feet while you aren't wearing Heavy armor.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisiteList":[]}],"7":[{"id":"Level 7: Feral Instinct_Barbarian","name":"Level 7: Feral Instinct","description":"Your instincts are so honed that you have Advantage on Initiative rolls.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisiteList":[]},{"id":"Level 7: Instinctive Pounce_Barbarian","name":"Level 7: Instinctive Pounce","description":"As part of the Bonus Action you take to enter your Rage, you can move up to half your Speed.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisiteList":[]}],"8":[{"id":"Level 8: Ability Score Improvement_Barbarian","name":"Level 8: Ability Score Improvement","description":"You gain the Ability Score Improvement feat (see chapter 5) or another feat of your choice for which you qualify. You gain this feature again at Barbarian levels 8, 12, and 16.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisiteList":[]}],"9":[{"id":"Level 9: Brutal Strike_Barbarian","name":"Level 9: Brutal Strike","description":"If you use Reckless Attack, you can forgo any Advantage on one Strength-based attack roll of your choice on your turn. The chosen attack roll mustn't have Disadvantage. If the chosen attack roll hits, the target takes an extra 1d10 damage of the same type dealt by the weapon or Unarmed Strike, and you can cause one Brutal Strike effect of your choice. You have the following effect options.\n\nForceful Blow:\nThe target is pushed 15 feet straight away from you. You can then move up to half your Speed straight toward the target without provoking Opportunity Attacks.\n\nHamstring Blow:\nThe target's Speed is reduced by 15 feet until the start of your next turn. A target can be affected by only one Hamstring Blow at a time-the most recent one.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisiteList":[]}],"11":[{"id":"Level 11: Relentless Rage_Barbarian","name":"Level 11: Relentless Rage","description":"Your Rage can keep you fighting despite grievous wounds. If you drop to 0 Hit Points while your Rage is active and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, your Hit Points instead change to a number equal to twice your Barbarian level.\n\nEach time you use this feature after the first, the DC increases by 5. When you finish a Short or Long Rest, the DC resets to 10.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisiteList":[]}],"12":[{"id":"Level 12: Ability Score Improvement_Barbarian","name":"Level 12: Ability Score Improvement","description":"You gain the Ability Score Improvement feat (see chapter 5) or another feat of your choice for which you qualify. You gain this feature again at Barbarian levels 8, 12, and 16.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisiteList":[]}],"13":[{"id":"Level 13: Improved Brutal Strike_Barbarian","name":"Level 13: Improved Brutal Strike","description":"You have honed new ways to attack furiously. The following effects are now among your Brutal Strike options.\n\nStaggering Blow:\nThe target has Disadvantage on the next saving throw it makes, and it can't make Opportunity Attacks until the start of your next turn.\n\nSundering Blow:\nBefore the start of your next turn, the next attack roll made by another creature against the target gains a +5 bonus to the roll. An attack roll can gain only one Sundering Blow bonus.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisiteList":[]}],"15":[{"id":"Level 15: Persistent Rage_Barbarian","name":"Level 15: Persistent Rage","description":"When you roll Initiative, you can regain all expended uses of Rage. After you regain uses of Rage in this way, you can't do so again until you finish a Long Rest.\n\nIn addition, your Rage is so fierce that it now lasts for 10 minutes without you needing to do anything to extend it from round to round. Your Rage ends early if you have the Unconscious condition (not just the Incapacitated condition) or don Heavy armor.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisiteList":[],"customFields":{"Persistent Rage":{"recovery":{"shortRest":"0","longRest":"1"},"15":1}}}],"16":[{"id":"Level 16: Ability Score Improvement_Barbarian","name":"Level 16: Ability Score Improvement","description":"You gain the Ability Score Improvement feat (see chapter 5) or another feat of your choice for which you qualify. You gain this feature again at Barbarian levels 8, 12, and 16.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisiteList":[]}],"17":[{"id":"Level 17: Improved Brutal Strike_Barbarian","name":"Level 17: Improved Brutal Strike","description":"The extra damage of your Brutal Strike increases to 2d10. In addition. you can use two different Brutal Strike effects whenever you use your Brutal Strike feature.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisiteList":[]}],"18":[{"id":"Level 18: Indomitable Might_Barbarian","name":"Level 18: Indomitable Might","description":"If your total for a Strength check or Strength saving throw is less than your Strength score, you can use that score in place of the total.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisiteList":[]}],"19":[{"id":"Level 19: Epic Boon_Barbarian","name":"Level 19: Epic Boon","description":"You gain an Epic Boon feat (see chapter 5) or another feat of your choice for which you qualify. Boon of Irresistible Offense is recommended.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisiteList":[]}],"20":[{"id":"Level 20: Primal Champion_Barbarian","name":"Level 20: Primal Champion","description":"You embody primal power. Your Strength and Constitution scores increase by 4, to a maximum of 25.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisiteList":[]}]},"subClasses":{"3":[{"subClassId":"Barbarian_path_of_the_berserker","name":"Path Of The Berserker","shortName":"","source":"Path Of The Berserker","description":"Channel Rage into Violent Fury\nBarbarians who walk the Path of the Berserker direct their Rage primarily toward violence. Their path is one of untrammeled fury, and they thrill in the chaos of battle as they allow their Rage to seize and empower them.\n\nSource:\tPlayer's Handbook 2024 p. 54","features":{"3":[{"id":"Level 3: Frenzy (Path Of The Berserker)_Path Of The Berserker","name":"Level 3: Frenzy (Path Of The Berserker)","description":"If you use Reckless Attack while your Rage is active, you deal extra damage to the first target you hit on your turn with a Strength-based attack. To determine the extra damage, roll a number of d6s equal to your Rage Damage bonus, and add them together. The damage has the same type as the weapon or Unarmed Strike used for the attack.\n\nSource:\tPlayer's Handbook 2024 p. 54","type":"Path Of The Berserker Feature","prerequisiteList":[]}],"6":[{"id":"Level 6: Mindless Rage (Path Of The Berserker)_Path Of The Berserker","name":"Level 6: Mindless Rage (Path Of The Berserker)","description":"You have Immunity to the Charmed and Frightened conditions while your Rage is active. If you're Charmed or Frightened when you enter your Rage, the condition ends on you.\n\nSource:\tPlayer's Handbook 2024 p. 54","type":"Path Of The Berserker Feature","prerequisiteList":[]}],"10":[{"id":"Level 10: Retaliation (Path Of The Berserker)_Path Of The Berserker","name":"Level 10: Retaliation (Path Of The Berserker)","description":"When you take damage from a creature that is within 5 feet of you, you can take a Reaction to make one melee attack against that creature, using a weapon or an Unarmed Strike.\n\nSource:\tPlayer's Handbook 2024 p. 54","type":"Path Of The Berserker Feature","prerequisiteList":[]}],"14":[{"id":"Level 14: Intimidating Presence (Path Of The Berserker)_Path Of The Berserker","name":"Level 14: Intimidating Presence (Path Of The Berserker)","description":"As a Bonus Action, you can strike terror into others with your menacing presence and primal power. When you do so, each creature of your choice in a 30-foot Emanation originating from you must make a Wisdom saving throw (DC 8 plus your Strength modifier and Proficiency Bonus). On a failed save, a creature has the Frightened condition for 1 minute. At the end of each of the Frightened creature's turns, the creature repeats the save, ending the effect on itself on a success.\n\nOnce you use this feature, you can't use it again until you finish a Long Rest unless you expend a use of your Rage (no action required) to restore your use of it.\n\nSource:\tPlayer's Handbook 2024 p. 54","type":"Path Of The Berserker Feature","prerequisiteList":[]}]},"additionalSpells":{}},{"subClassId":"Barbarian_path_of_the_wild_heart","name":"Path Of The Wild Heart","shortName":"","source":"Path Of The Wild Heart","description":"Walk in Community with the Animal World\nBarbarians who follow the Path of the Wild Heart view themselves as kin to animals. These Barbarians learn magical means to communicate with animals, and their Rage heightens their connection to animals as it fills them with supernatural might.\n\nSource:\tPlayer's Handbook 2024 p. 55","features":{"3":[{"id":"Level 3: Animal Speaker (Path Of The Wild Heart)_Path Of The Wild Heart","name":"Level 3: Animal Speaker (Path Of The Wild Heart)","description":"You can cast the Beast Sense and Speak with Animals spells but only as Rituals. Wisdom is your spellcasting ability for them.\n\nSource:\tPlayer's Handbook 2024 p. 55","type":"Path Of The Wild Heart Feature","prerequisiteList":[]},{"id":"Level 3: Rage Of The Wilds (Path Of The Wild Heart)_Path Of The Wild Heart","name":"Level 3: Rage Of The Wilds (Path Of The Wild Heart)","description":"Your Rage taps into the primal power of animals. Whenever you activate your Rage, you gain one of the following options of your choice.\n\nBear:\nWhile your Rage is active, you have Resistance to every damage type except Force, Necrotic, Psychic, and Radiant.\n\nEagle:\nWhen you activate your Rage, you can take the Disengage and Dash actions as part of that Bonus Action. While your Rage is active, you can take a Bonus Action to take both of those actions.\n\nWolf:\nWhile your Rage is active, your allies have Advantage on attack rolls against any enemy of yours within 5 feet of you.\n\nSource:\tPlayer's Handbook 2024 p. 55","type":"Path Of The Wild Heart Feature","prerequisiteList":[]}],"6":[{"id":"Level 6: Aspect Of The Wilds (Path Of The Wild Heart)_Path Of The Wild Heart","name":"Level 6: Aspect Of The Wilds (Path Of The Wild Heart)","description":"You gain one of the following options of your choice. Whenever you finish a Long Rest, you can change your choice.\n\nOwl:\nYou have Darkvision with a range of 60 feet. If you already have Darkvision, its range increases by 60 feet.\n\nPanther:\nYou have a Climb Speed equal to your Speed.\n\nSalmon:\nYou have a Swim Speed equal to your Speed.\n\nSource:\tPlayer's Handbook 2024 p. 55","type":"Path Of The Wild Heart Feature","prerequisiteList":[]}],"10":[{"id":"Level 10: Nature Speaker (Path Of The Wild Heart)_Path Of The Wild Heart","name":"Level 10: Nature Speaker (Path Of The Wild Heart)","description":"You can cast the Commune with Nature spell but only as a Ritual. Wisdom is your spellcasting ability for it.\n\nSource:\tPlayer's Handbook 2024 p. 55","type":"Path Of The Wild Heart Feature","prerequisiteList":[]}],"14":[{"id":"Level 14: Power Of The Wilds (Path Of The Wild Heart)_Path Of The Wild Heart","name":"Level 14: Power Of The Wilds (Path Of The Wild Heart)","description":"Whenever you activate your Rage, you gain one of the following options of your choice.\n\nFalcon:\nWhile your Rage is active, you have a Fly Speed equal to your Speed if you aren't wearing any armor.\n\nLion:\nWhile your Rage is active, any of your enemies within 5 feet of you have Disadvantage on attack rolls against targets other than you or another Barbarian who has this option active.\n\nRam:\nWhile your Rage is active, you can cause a Large or smaller creature to have the Prone condition when you hit it with a melee attack.\n\nSource:\tPlayer's Handbook 2024 p. 55","type":"Path Of The Wild Heart Feature","prerequisiteList":[]}]},"additionalSpells":{}},{"subClassId":"Barbarian_path_of_the_world_tree","name":"Path Of The World Tree","shortName":"","source":"Path Of The World Tree","description":"Trace the Roots and Branches of the Multi verse\nBarbarians who follow the Path of the World Tree connect with the cosmic tree Yggdrasil through their Rage. This tree grows among the Outer Planes, connecting them to each other and the Material Plane. These Barbarians draw on the tree's magic for vitality and as a means of dimensional travel.\n\nSource:\tPlayer's Handbook 2024 p. 56","features":{"3":[{"id":"Level 3: Vitality Of The Tree (Path Of The World Tree)_Path Of The World Tree","name":"Level 3: Vitality Of The Tree (Path Of The World Tree)","description":"Your Rage taps into the life force of the World Tree. You gain the following benefits:\n\nVitality Surge:\nWhen you activate your Rage, you gain a number of Temporary Hit Points equal to your Barbarian level.\n\nLife-Giving Force:\nAt the start of each of your turns while your Rage is active, you can choose another creature within 10 feet of yourself to gain Temporary Hit Points. To determine the number of Temporary Hit Points, roll a number of d6s equal to your Rage Damage bonus, and add them together. If any of these Temporary Hit Points remain when your Rage ends, they vanish.\n\nSource:\tPlayer's Handbook 2024 p. 56","type":"Path Of The World Tree Feature","prerequisiteList":[]}],"6":[{"id":"Level 6: Branches Of The Tree (Path Of The World Tree)_Path Of The World Tree","name":"Level 6: Branches Of The Tree (Path Of The World Tree)","description":"Whenever a creature you can see starts its turn within 30 feet of you while your Rage is active, you can take a Reaction to summon spectral branches of the World Tree around it. The target must succeed on a Strength saving throw (DC 8 plus your Strength modifier and Proficiency Bonus) or be teleported to an unoccupied space you can see within 5 feet of yourself or in the nearest unoccupied space you can see. After the target teleports, you can reduce its Speed to 0 until the end of the current turn.\n\nSource:\tPlayer's Handbook 2024 p. 56","type":"Path Of The World Tree Feature","prerequisiteList":[]}],"10":[{"id":"Level 10: Battering Roots (Path Of The World Tree)_Path Of The World Tree","name":"Level 10: Battering Roots (Path Of The World Tree)","description":"During your turn, your reach is 10 feet greater with any Melee weapon that has the Heavy or Versatile property, as tendrils of the World Tree extend from you. When you hit with such a weapon on your turn, you can activate the Push or Topple mastery property in addition to a different mastery property you're using with that weapon.\n\nSource:\tPlayer's Handbook 2024 p. 56","type":"Path Of The World Tree Feature","prerequisiteList":[]}],"14":[{"id":"Level 14: Travel Along The Tree (Path Of The World Tree)_Path Of The World Tree","name":"Level 14: Travel Along The Tree (Path Of The World Tree)","description":"When you activate your Rage and as a Bonus Action while your Rage is active, you can teleport up to 60 feet to an unoccupied space you can see.\n\nIn addition, once per Rage, you can increase the range of that teleport to 150 feet. When you do so, you can also bring up to six willing creatures who are within 10 feet of you. Each creature teleports to an unoccupied space of your choice within 10 feet of your destination space.\n\nSource:\tPlayer's Handbook 2024 p. 56","type":"Path Of The World Tree Feature","prerequisiteList":[]}]},"additionalSpells":{}},{"subClassId":"Barbarian_path_of_the_zealot","name":"Path Of The Zealot","shortName":"","source":"Path Of The Zealot","description":"Rage in Ecstatic Union with a God\nBarbarians who walk the Path of the Zealot receive boons from a god or pantheon. These Barbarians experience their Rage as an ecstatic episode of divine union that infuses them with power. They are often allies to the priests and other followers of their god or pantheon.\n\nSource:\tPlayer's Handbook 2024 p. 57","features":{"3":[{"id":"Level 3: Divine Fury (Path Of The Zealot)_Path Of The Zealot","name":"Level 3: Divine Fury (Path Of The Zealot)","description":"You can channel divine power into your strikes. On each of your turns while your Rage is active, the first creature you hit with a weapon or an Unarmed Strike takes extra damage equal to 1d6 plus half your Barbarian level (round down). The extra damage is Necrotic or Radiant; you choose the type each time you deal the damage.\n\nSource:\tPlayer's Handbook 2024 p. 57","type":"Path Of The Zealot Feature","prerequisiteList":[]},{"id":"Level 3: Warrior Of The Gods (Path Of The Zealot)_Path Of The Zealot","name":"Level 3: Warrior Of The Gods (Path Of The Zealot)","description":"A divine entity helps ensure you can continue the fight. You have a pool of four d12s that you can spend to heal yourself. As a Bonus Action, you can expend dice from the pool, roll them, and regain a number of Hit Points equal to the roll's total.\n\nYour pool regains all expended dice when you finish a Long Rest.\n\nThe pool's maximum number of dice increases by one when you reach Barbarian levels 6 (5 dice), 12 (6 dice), and 17 (7 dice).\n\nSource:\tPlayer's Handbook 2024 p. 57","type":"Path Of The Zealot Feature","prerequisiteList":[],"customFields":{"Warrior Of The Gods":{"recovery":{"shortRest":"0","longRest":"1"},"3":4,"6":5,"12":6,"17":7}}}],"6":[{"id":"Level 6: Fanatical Focus (Path Of The Zealot)_Path Of The Zealot","name":"Level 6: Fanatical Focus (Path Of The Zealot)","description":"Once per active Rage, if you fail a saving throw, you can reroll it with a bonus equal to your Rage Damage bonus, and you must use the new roll.\n\nSource:\tPlayer's Handbook 2024 p. 57","type":"Path Of The Zealot Feature","prerequisiteList":[]}],"10":[{"id":"Level 10: Zealous Presence (Path Of The Zealot)_Path Of The Zealot","name":"Level 10: Zealous Presence (Path Of The Zealot)","description":"As a Bonus Action, you unleash a battle cry infused with divine energy. Up to ten other creatures of your choice within 60 feet of you gain Advantage on attack rolls and saving throws until the start of your next turn.\n\nOnce you use this feature, you can't use it again until you finish a Long Rest unless you expend a use of your Rage (no action required) to restore your use of it.\n\nSource:\tPlayer's Handbook 2024 p. 57","type":"Path Of The Zealot Feature","prerequisiteList":[]}],"14":[{"id":"Level 14: Rage Of The Gods (Path Of The Zealot)_Path Of The Zealot","name":"Level 14: Rage Of The Gods (Path Of The Zealot)","description":"When you activate your Rage, you can assume the form of a divine warrior. This form lasts for 1 minute or until you drop to 0 Hit Points. Once you use this feature, you can't do so again until you finish a Long Rest.\n\nWhile in this form, you gain the benefits below.\n\nFlight:\nYou have a Fly Speed equal to your Speed and can hover.\n\nResistance:\nYou have Resistance to Necrotic, Psychic, and Radiant damage.\n\nRevivification:\nWhen a creature within 30 feet of you would drop to 0 Hit Points. you can take a Reaction to expend a use of your Rage to instead change the target's Hit Points to a number equal to your Barbarian level.\n\nSource:\tPlayer's Handbook 2024 p. 57","type":"Path Of The Zealot Feature","prerequisiteList":[]}]},"additionalSpells":{}}]},"selectedSubclassId":null}],"attributes":{"Strength":15,"Dexterity":14,"Constitution":13,"Intelligence":13,"Wisdom":12,"Charisma":8},"attributeModifiers":{},"image":null,"bio":"","background":{"id":"acolyte","name":"Acolyte","source":"","description":"You devoted yourself to service in a temple, either nestled in a town or secluded in a sacred grove. There you performed rites in honor of a god or pantheon. You served under a priest and studied religion. Thanks to your priest's instruction and your own devotion, you also learned how to channel a modicum of divine power in service to your place of worship and the people who prayed there.\n\nSource:\tPlayer's Handbook 2024 p. 178","abilityScores":["Intelligence","Wisdom","Charisma"],"feat":{"id":"magic_initiate_(cleric)","name":"Magic Initiate (Cleric)","description":"You gain the following benefits.\n\nTwo Cantrips:\nYou learn two cantrips of your choice from the Cleric, Druid, or Wizard spell list. Intelligence, Wisdom, or Charisma is your spellcasting ability for this feat's spells (choose when you select this feat).\n\nLevel 1 Spell:\nChoose a level 1 spell from the same list you selected for this feat's cantrips. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have.\n\nSpell Change:\nWhenever you gain a new level, you can replace one of the spells you chose for this feat with a different spell of the same level from the chosen spell list.\n\nRepeatable:\nYou can take this feat more than once, but you must choose a different spell list each time.\n\nSource:\tPlayer's Handbook 2024 p. 201","type":"Feat","prerequisiteList":[]},"skillProficiencies":["Insight","Religion"],"toolProficiency":"Calligrapher's Supplies","equipment":["Calligrapher's Supplies, Book (prayers), Holy Symbol, Parchment (10 sheets), Robe, 8 GP","50 GP"]},"alignment":"Lawful Neutral","maxHP":13,"currentHP":13,"temporaryHP":0,"armorClass":12,"speed":"30 ft.","initiative":0,"armorClassModifier":0,"speedModifier":0,"initiativeModifier":0,"proficiencyBonusModifier":0,"proficiencyBonus":2,"languages":["Common","Common Sign Language","Draconic"],"weaponProficiencies":["Simple Weapons","Martial Weapons"],"armorShieldProficiencies":["Light Armor","Medium Armor","Shields"],"equipment":[{"id":"greataxe","title":"Greataxe","source":"","description":"Heavy: You have Disadvantage on attack rolls with a Heavy weapon if it's a Melee weapon and your Strength score isn't at least 13 or if it's a Ranged weapon and  your Dexterity score isn't at least 13.\n\nTwo-Handed: A Two-Handed weapon requires two hands when you attack with it.\n\nCleave (Mastery): If you hit a creature with a melee attack roll using this weapon, you can make a melee attack roll with the weapon against a second creature within 5 feet of the first that is also within your reach. On a hit, the second creature takes the weapon's damage, but don't add your ability modifier to that damage unless that modifier is negative. You can make this extra attack only once per turn.\n\nProficiency: martial, greataxe\nSource:\tPlayer's Handbook 2024 p. 215","properties":"Martial, Heavy, Two-Handed","equipped":true,"attuned":false,"requiresAttunement":false,"quantity":1,"weight":7.0,"type":"Melee Weapon","hitBonus":4,"damages":{"Slashing":"1d12+2"},"price":"30 gp","dexToAttack":false,"useAmmo":false,"ammunitionName":null,"martialWeapon":true,"originalDamageFormula":"1d12","ac":null,"stealthDisadvantage":false,"requirements":null,"damageAttribute":"Strength","mastery":"Cleave","rarity":null,"useBothHands":true,"versatileDamage":null,"resist":null,"attachedSpells":null,"bonusAc":null,"bonusSavingThrow":null,"bonusWeapon":null,"charges":null,"recharge":null,"rechargeAmount":null},{"id":"explorer's_pack","title":"Explorer's Pack","source":"","description":"An Explorer's Pack contains the following items: Backpack, Bedroll, 2 flasks of Oil, 10 days of Rations, Rope, Tinderbox, 10 Torches, and Waterskin.\n\nSource:\tPlayer's Handbook 2024 p. 225","properties":"","equipped":false,"attuned":false,"requiresAttunement":false,"quantity":1,"weight":55.0,"type":"Gear","hitBonus":null,"damages":{},"price":"10 gp","dexToAttack":false,"useAmmo":false,"ammunitionName":null,"martialWeapon":false,"originalDamageFormula":"","ac":null,"stealthDisadvantage":false,"requirements":null,"damageAttribute":"Strength","mastery":null,"rarity":null,"useBothHands":false,"versatileDamage":null,"resist":null,"attachedSpells":null,"bonusAc":null,"bonusSavingThrow":null,"bonusWeapon":null,"charges":null,"recharge":null,"rechargeAmount":null},{"id":"forgery_kit","title":"Forgery Kit","source":"","description":"Ability: Dexterity\nUtilize: Mimic 10 or fewer words of someone else's handwriting (DC 15), or duplicate a wax seal (DC 20)\n\nSource:\tPlayer's Handbook 2024 p. 221","properties":"","equipped":false,"attuned":false,"requiresAttunement":false,"quantity":1,"weight":5.0,"type":"Gear","hitBonus":null,"damages":{},"price":"15 gp","dexToAttack":false,"useAmmo":false,"ammunitionName":null,"martialWeapon":false,"originalDamageFormula":"","ac":null,"stealthDisadvantage":false,"requirements":null,"damageAttribute":"Strength","mastery":null,"rarity":"tools","useBothHands":false,"versatileDamage":null,"resist":null,"attachedSpells":null,"bonusAc":null,"bonusSavingThrow":null,"bonusWeapon":null,"charges":null,"recharge":null,"rechargeAmount":null},{"id":"costume","title":"Costume","source":"","description":"While wearing a Costume, you have Advantage on any ability check you make to impersonate the person or type of person it represents.\n\nSource:\tPlayer's Handbook 2024 p. 225","properties":"","equipped":false,"attuned":false,"requiresAttunement":false,"quantity":1,"weight":4.0,"type":"Gear","hitBonus":null,"damages":{},"price":"5 gp","dexToAttack":false,"useAmmo":false,"ammunitionName":null,"martialWeapon":false,"originalDamageFormula":"","ac":null,"stealthDisadvantage":false,"requirements":null,"damageAttribute":"Strength","mastery":null,"rarity":null,"useBothHands":false,"versatileDamage":null,"resist":null,"attachedSpells":null,"bonusAc":null,"bonusSavingThrow":null,"bonusWeapon":null,"charges":null,"recharge":null,"rechargeAmount":null},{"id":"1744494497401","title":"Fine Clothes","source":"","description":"","properties":"","equipped":true,"attuned":false,"requiresAttunement":false,"quantity":1,"weight":0.0,"type":"Other","hitBonus":null,"damages":{},"price":null,"dexToAttack":false,"useAmmo":false,"ammunitionName":null,"martialWeapon":false,"originalDamageFormula":null,"ac":null,"stealthDisadvantage":false,"requirements":null,"damageAttribute":"Strength","mastery":null,"rarity":null,"useBothHands":false,"versatileDamage":null,"resist":null,"attachedSpells":null,"bonusAc":null,"bonusSavingThrow":null,"bonusWeapon":null,"charges":null,"recharge":null,"rechargeAmount":null},{"id":"handaxe","title":"Handaxe","source":"Handaxe","description":"Light: When you take the Attack action on your turn and. attack with a Light weapon, you can make one extra attack as a Bonus Action later on the same turn. That extra attack must be made with a different Light weapon, and you don't add your ability modifier to the extra attack's damage unless that modifier is negative. For example, you can attack with a Shortsword in one hand and a Dagger in the other using the Attack action and a Bonus Action, but you don't add your Strength or Dexterity modifier to the damage roll of the Bonus Action unless that modifier is negative.\n\nThrown: If a weapon has the Thrown property, you can throw the weapon to make a ranged attack, and you can draw that weapon as part of the attack. If the weapon is a Melee weapon, use the same ability modifier for the attack and damage rolls that you use for a melee attack with that weapon.\n\nVex (Mastery): If you hit a creature with this weapon and deal damage to the creature, you have Advantage on your next attack roll against that creature before the end of your next turn.\n\nProficiency: simple, handaxe\nSource:\tPlayer's Handbook 2024 p. 215","properties":"Light, Thrown, Ranged (20/60)","equipped":false,"attuned":false,"requiresAttunement":false,"quantity":4,"weight":2.0,"type":"Melee Weapon","hitBonus":4,"damages":{"Slashing":"1d6+2"},"price":"5 gp","dexToAttack":false,"useAmmo":false,"ammunitionName":null,"martialWeapon":true,"originalDamageFormula":"1d6","ac":null,"stealthDisadvantage":false,"requirements":null,"damageAttribute":"Strength","mastery":"Vex","rarity":null,"useBothHands":false,"versatileDamage":null,"resist":null,"attachedSpells":null,"bonusAc":null,"bonusSavingThrow":null,"bonusWeapon":null,"charges":null,"recharge":null,"rechargeAmount":null}],"featuresAndTraits":[{"id":"Barbarian_Barbarian","name":"Barbarian","description":"Barbarians are mighty warriors who are powered by primal forces of the multiverse that manifest as a Rage. More than a mere emotion—and not limited to anger—this Rage is an incarnation of a predator's ferocity, a storm's fury, and a sea's turmoil.\n\nSome Barbarians personify their Rage as a fierce spirit or revered forebear. Others see it as a connection to the pain and anguish of the world, as an impersonal tangle of wild magic, or as an expression of their own deepest self. For every Barbarian, their Rage is a power that fuels not just battle prowess, but also uncanny reflexes and heightened senses.\n\nBarbarians often serve as protectors and leaders in their communities. They charge headlong into danger so those under their protection don't have to. Their courage in the face of danger makes Barbarians perfectly suited for adventure.\n\nSource:\tPlayer's Handbook 2024 p. 51","type":"Barbarian Class Feature","prerequisiteList":[]},{"id":"Level 1: Rage_Barbarian","name":"Level 1: Rage","description":"You can imbue yourself with a primal power called Rage, a force that grants you extraordinary might and resilience. You can enter it as a Bonus Action if you aren't wearing Heavy armor.\n\nYou can enter your Rage the number of times shown for your Barbarian level in the Rages column of the Barbarian Features table. You regain one expended use when you finish a Short Rest, and you regain all expended uses when you finish a Long Rest.\n\nWhile active, your Rage follows the rules below.\n\nDamage Resistance:\nYou have Resistance to Bludgeoning, Piercing, and Slashing damage.\n\nRage Damage:\nWhen you make an attack using Strength- with either a weapon or an Unarmed Strike- and deal damage to the target, you gain a bonus to the damage that increases as you gain levels as a Barbarian, as shown in the Rage Damage column of the Barbarian Features table (+2 at 1st level, +3 at 9th level, +4 at 16th level).\n\nStrength Advantage:\nYou have Advantage on Strength checks and Strength saving throws.\n\nNo Concentration or Spells:\nYou can't maintain Concentration, and you can't cast spells.\n\nDuration:\nThe Rage lasts until the end of your next turn, and it ends early if you don Heavy armor or have the Incapacitated condition. If your Rage is still active on your next turn, you can extend the Rage for another round by doing one of the following:\n\n\t• Make an attack roll against an enemy.\n\t• Force an enemy to make a saving throw.\n\t• Take a Bonus Action to extend your Rage.\n\nEach time the Rage is extended, it lasts until the end of your next turn. You can maintain a Rage for up to 10 minutes.\n\nSource:\tPlayer's Handbook 2024 p. 51","type":"Barbarian Class Feature","prerequisiteList":[],"customFields":{"Rage":{"recovery":{"shortRest":"0","longRest":"1"},"1":2,"3":3,"6":4,"12":5,"17":6}}},{"id":"Level 1: Unarmored Defense_Barbarian","name":"Level 1: Unarmored Defense","description":"While you aren't wearing any armor, your base Armor Class equals 10 plus your Dexterity and Constitution modifiers. You can use a Shield and still gain this benefit.\n\nSource:\tPlayer's Handbook 2024 p. 51","type":"Barbarian Class Feature","prerequisiteList":[]},{"id":"Level 1: Weapon Mastery_Barbarian","name":"Level 1: Weapon Mastery","description":"Your training with weapons allows you to use the mastery properties of two kinds of Simple or Martial Melee weapons of your choice, such as Greataxes and Handaxes. Whenever you finish a Long Rest, you can practice weapon drills and change one of those weapon choices.\n\nWhen you reach certain Barbarian levels, you gain the ability to use the mastery properties of more kinds of weapons, as shown in the Weapon Mastery column of the Barbarian Features table. (2 at level 2, 3 at level 4, 4 at level 10)\n\nSource:\tPlayer's Handbook 2024 p. 52","type":"Barbarian Class Feature","prerequisiteList":[]}],"feats":[{"id":"magic_initiate_(cleric)","name":"Magic Initiate (Cleric)","description":"You gain the following benefits.\n\nTwo Cantrips:\nYou learn two cantrips of your choice from the Cleric, Druid, or Wizard spell list. Intelligence, Wisdom, or Charisma is your spellcasting ability for this feat's spells (choose when you select this feat).\n\nLevel 1 Spell:\nChoose a level 1 spell from the same list you selected for this feat's cantrips. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have.\n\nSpell Change:\nWhenever you gain a new level, you can replace one of the spells you chose for this feat with a different spell of the same level from the chosen spell list.\n\nRepeatable:\nYou can take this feat more than once, but you must choose a different spell list each time.\n\nSource:\tPlayer's Handbook 2024 p. 201","type":"Feat","prerequisiteList":[]}],"spells":[],"spellSlots":{},"spentCustomFields":{"Rage":{"1":0}},"skillProficiencies":{"Insight":true,"Religion":true,"Animal Handling":true,"Athletics":true,"Strength":true,"Constitution":true},"skillExpertise":{},"halfSkillProficiency":{"Acrobatics":false,"Animal Handling":false,"Arcana":false,"Athletics":false,"Deception":false,"History":false,"Insight":false,"Intimidation":false,"Investigation":false,"Medicine":false,"Nature":false,"Perception":false,"Performance":false,"Persuasion":false,"Religion":false,"Sleight of Hand":false,"Stealth":false,"Survival":false},"skillModifiers":{},"hitDice":"1d12","xp":0,"hitDiceSpent":"","maxCarryingWeight":0.0,"size":"Medium","copperPieces":0,"silverPieces":0,"electrumPieces":0,"goldPieces":23,"platinumPieces":0,"conditions":[],"isNPC":false,"type":"Humanoid","cr":0.0,"vulnerabilities":[],"resistances":[],"immunities":[],"saves":[],"inspiration":false,"deathFailSaves":0,"deathSuccessSaves":0}