{"name":"Teste","species":{"id":"dwarf","name":"Dwarf","description":"Dwarves were raised from the earth in the elder days by a deity of the forge. Called by various names on different worlds -Moradin, Reorx, and others- that god gave dwarves an affinity for stone and metal and for living underground. The god also made them resilient like the mountains, with a life span of about 350 years.\n\nSquat and often bearded, the original dwarves carved cities and strongholds into mountainsides and under the earth. Their oldest legends tell of conflicts with the monsters of mountaintops and the Underdark, whether those monsters were towering giants or subterranean horrors. Inspired by those tales, dwarves of any culture often sing of valorous deeds-especially of the little overcoming the mighty.\n\nOn some worlds in the multiverse, the first settlements of dwarves were built in hills or mountains, and the families who trace their ancestry to those settlements call themselves hill dwarves or mountain dwarves, respectively. The Greyhawk and Dragonlance settings have such communities.\n\nSource:\tPlayer's Handbook 2024 p. 188","size":"Medium","speed":"30 ft.","traits":[{"name":"Creature Type","description":"Humanoid"},{"name":"Size","description":"Medium (about 4-5 feet tall)"},{"name":"Darkvision","description":"You have Darkvision with a range of 120 feet."},{"name":"Dwarven Resilience","description":"You have Resistance to Poison damage. You also have Advantage on saving throws you make to avoid or end the Poisoned condition."},{"name":"Dwarven Toughness","description":"Your Hit Point maximum increases by 1, and it increases by 1 again whenever you gain a level."},{"name":"Stonecunning","description":"As a Bonus Action, you gain Tremorsense with a range of 60 feet for 10 minutes. You must be on a stone surface or touching a stone surface to use this Tremorsense. The stone can be natural or worked.\n\nYou can use this Bonus Action a number of times equal to your Proficiency Bonus, and you regain all expended uses when you finish a Long Rest."}],"ability":[],"proficiency":[],"spellAbility":""},"class":[{"id":"barbarian}","name":"Barbarian","description":"Barbarians are mighty warriors who are powered by primal forces of the multiverse that manifest as a Rage. More than a mere emotion—and not limited to anger—this Rage is an incarnation of a predator's ferocity, a storm's fury, and a sea's turmoil.\n\nSome Barbarians personify their Rage as a fierce spirit or revered forebear. Others see it as a connection to the pain and anguish of the world, as an impersonal tangle of wild magic, or as an expression of their own deepest self. For every Barbarian, their Rage is a power that fuels not just battle prowess, but also uncanny reflexes and heightened senses.\n\nBarbarians often serve as protectors and leaders in their communities. They charge headlong into danger so those under their protection don't have to. Their courage in the face of danger makes Barbarians perfectly suited for adventure.\n\nSource:\tPlayer's Handbook 2024 p. 51","primaryAbility":"Strength","hitPointDie":"1d12","hitPointsAtLevel1":"12 + Constitution","hitPointsPerLevel":"1d12 + Constitution or 7 + Constitution","savingThrowProficiencies":["Strength","Constitution"],"skillProficiencies":["Animal Handling","Athletics","Intimidation","Nature","Perception","Survival"],"weaponProficiencies":"Simple Weapons, Martial Weapons","armorTraining":"Light Armor, Medium Armor, Shields","startingEquipmentOptions":["Greataxe, 4 Handaxe, Explorer's Pack, and 15 GP","75 GP"],"level":1,"numberOfSkills":2,"multiclassNumberOfSkills":0,"multiclassWeaponProficiencies":"Martial Weapons","multiclassArmorTraining":"Shields","spellcastingMultiplier":1.0,"classFeatures":{"1":[{"id":"Barbarian_Barbarian","name":"Barbarian","description":"Barbarians are mighty warriors who are powered by primal forces of the multiverse that manifest as a Rage. More than a mere emotion—and not limited to anger—this Rage is an incarnation of a predator's ferocity, a storm's fury, and a sea's turmoil.\n\nSome Barbarians personify their Rage as a fierce spirit or revered forebear. Others see it as a connection to the pain and anguish of the world, as an impersonal tangle of wild magic, or as an expression of their own deepest self. For every Barbarian, their Rage is a power that fuels not just battle prowess, but also uncanny reflexes and heightened senses.\n\nBarbarians often serve as protectors and leaders in their communities. They charge headlong into danger so those under their protection don't have to. Their courage in the face of danger makes Barbarians perfectly suited for adventure.\n\nSource:\tPlayer's Handbook 2024 p. 51","type":"Barbarian Class Feature","prerequisites":""},{"id":"Level 1: Rage_Barbarian","name":"Level 1: Rage","description":"You can imbue yourself with a primal power called Rage, a force that grants you extraordinary might and resilience. You can enter it as a Bonus Action if you aren't wearing Heavy armor.\n\nYou can enter your Rage the number of times shown for your Barbarian level in the Rages column of the Barbarian Features table. You regain one expended use when you finish a Short Rest, and you regain all expended uses when you finish a Long Rest.\n\nWhile active, your Rage follows the rules below.\n\nDamage Resistance:\nYou have Resistance to Bludgeoning, Piercing, and Slashing damage.\n\nRage Damage:\nWhen you make an attack using Strength- with either a weapon or an Unarmed Strike- and deal damage to the target, you gain a bonus to the damage that increases as you gain levels as a Barbarian, as shown in the Rage Damage column of the Barbarian Features table (+2 at 1st level, +3 at 9th level, +4 at 16th level).\n\nStrength Advantage:\nYou have Advantage on Strength checks and Strength saving throws.\n\nNo Concentration or Spells:\nYou can't maintain Concentration, and you can't cast spells.\n\nDuration:\nThe Rage lasts until the end of your next turn, and it ends early if you don Heavy armor or have the Incapacitated condition. If your Rage is still active on your next turn, you can extend the Rage for another round by doing one of the following:\n\n\t• Make an attack roll against an enemy.\n\t• Force an enemy to make a saving throw.\n\t• Take a Bonus Action to extend your Rage.\n\nEach time the Rage is extended, it lasts until the end of your next turn. You can maintain a Rage for up to 10 minutes.\n\nSource:\tPlayer's Handbook 2024 p. 51","type":"Barbarian Class Feature","prerequisites":"","customFields":{"Rage":{"recovery":{"shortRest":"0","longRest":"1"},"1":2,"3":3,"6":4,"12":5,"17":6}}},{"id":"Level 1: Unarmored Defense_Barbarian","name":"Level 1: Unarmored Defense","description":"While you aren't wearing any armor, your base Armor Class equals 10 plus your Dexterity and Constitution modifiers. You can use a Shield and still gain this benefit.\n\nSource:\tPlayer's Handbook 2024 p. 51","type":"Barbarian Class Feature","prerequisites":""},{"id":"Level 1: Weapon Mastery_Barbarian","name":"Level 1: Weapon Mastery","description":"Your training with weapons allows you to use the mastery properties of two kinds of Simple or Martial Melee weapons of your choice, such as Greataxes and Handaxes. Whenever you finish a Long Rest, you can practice weapon drills and change one of those weapon choices.\n\nWhen you reach certain Barbarian levels, you gain the ability to use the mastery properties of more kinds of weapons, as shown in the Weapon Mastery column of the Barbarian Features table. (2 at level 2, 3 at level 4, 4 at level 10)\n\nSource:\tPlayer's Handbook 2024 p. 52","type":"Barbarian Class Feature","prerequisites":""}],"2":[{"id":"Level 2: Danger Sense_Barbarian","name":"Level 2: Danger Sense","description":"You gain an uncanny sense of when things aren't as they should be, giving you an edge when you dodge perils. You have Advantage on Dexterity saving throws unless you have the Incapacitated condition.\n\nSource:\tPlayer's Handbook 2024 p. 52","type":"Barbarian Class Feature","prerequisites":""},{"id":"Level 2: Reckless Attack_Barbarian","name":"Level 2: Reckless Attack","description":"You can throw aside all concern for defense to attack with increased ferocity. When you make your first attack roll on your turn, you can decide to attack recklessly. Doing so gives you Advantage on attack rolls using Strength until the start of your next turn, but attack rolls against you have Advantage during that time.\n\nSource:\tPlayer's Handbook 2024 p. 52","type":"Barbarian Class Feature","prerequisites":""}],"3":[{"id":"Level 3: Barbarian Subclass_Barbarian","name":"Level 3: Barbarian Subclass","description":"You gain a Barbarian subclass of your choice. The Path of the Berserker, Path of the Wild Heart, Path of the World Tree, and Path of the Zealot subclasses are detailed after this class's description. A subclass is a specialization that grants you features at certain Barbarian levels. For the rest of your career, you gain each of your subclass's features that are of your Barbarian level or lower.\n\nSource:\tPlayer's Handbook 2024 p. 52","type":"Barbarian Class Feature","prerequisites":""},{"id":"Level 3: Primal Knowledge_Barbarian","name":"Level 3: Primal Knowledge","description":"You gain proficiency in another skill of your choice from the skill list available to Barbarians at level 1.\n\nIn addition, while your Rage is active, you can channel primal power when you attempt certain tasks; whenever you make an ability check using one of the following skills, you can make it as a Strength check even if it normally uses a different ability: Acrobatics, Intimidation, Perception, Stealth, or Survival. When you use this ability, your Strength represents primal power coursing through you, honing your agility, bearing, and senses.\n\nSource:\tPlayer's Handbook 2024 p. 52","type":"Barbarian Class Feature","prerequisites":""}],"4":[{"id":"Level 4: Ability Score Improvement_Barbarian","name":"Level 4: Ability Score Improvement","description":"You gain the Ability Score Improvement feat (see chapter 5) or another feat of your choice for which you qualify. You gain this feature again at Barbarian levels 8, 12, and 16.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisites":""}],"5":[{"id":"Level 5: Extra Attack_Barbarian","name":"Level 5: Extra Attack","description":"You can attack twice instead of once whenever you take the Attack action on your turn.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisites":""},{"id":"Level 5: Fast Movement_Barbarian","name":"Level 5: Fast Movement","description":"Your speed increases by 10 feet while you aren't wearing Heavy armor.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisites":""}],"7":[{"id":"Level 7: Feral Instinct_Barbarian","name":"Level 7: Feral Instinct","description":"Your instincts are so honed that you have Advantage on Initiative rolls.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisites":""},{"id":"Level 7: Instinctive Pounce_Barbarian","name":"Level 7: Instinctive Pounce","description":"As part of the Bonus Action you take to enter your Rage, you can move up to half your Speed.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisites":""}],"8":[{"id":"Level 8: Ability Score Improvement_Barbarian","name":"Level 8: Ability Score Improvement","description":"You gain the Ability Score Improvement feat (see chapter 5) or another feat of your choice for which you qualify. You gain this feature again at Barbarian levels 8, 12, and 16.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisites":""}],"9":[{"id":"Level 9: Brutal Strike_Barbarian","name":"Level 9: Brutal Strike","description":"If you use Reckless Attack, you can forgo any Advantage on one Strength-based attack roll of your choice on your turn. The chosen attack roll mustn't have Disadvantage. If the chosen attack roll hits, the target takes an extra 1d10 damage of the same type dealt by the weapon or Unarmed Strike, and you can cause one Brutal Strike effect of your choice. You have the following effect options.\n\nForceful Blow:\nThe target is pushed 15 feet straight away from you. You can then move up to half your Speed straight toward the target without provoking Opportunity Attacks.\n\nHamstring Blow:\nThe target's Speed is reduced by 15 feet until the start of your next turn. A target can be affected by only one Hamstring Blow at a time-the most recent one.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisites":""}],"11":[{"id":"Level 11: Relentless Rage_Barbarian","name":"Level 11: Relentless Rage","description":"Your Rage can keep you fighting despite grievous wounds. If you drop to 0 Hit Points while your Rage is active and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, your Hit Points instead change to a number equal to twice your Barbarian level.\n\nEach time you use this feature after the first, the DC increases by 5. When you finish a Short or Long Rest, the DC resets to 10.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisites":""}],"12":[{"id":"Level 12: Ability Score Improvement_Barbarian","name":"Level 12: Ability Score Improvement","description":"You gain the Ability Score Improvement feat (see chapter 5) or another feat of your choice for which you qualify. You gain this feature again at Barbarian levels 8, 12, and 16.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisites":""}],"13":[{"id":"Level 13: Improved Brutal Strike_Barbarian","name":"Level 13: Improved Brutal Strike","description":"You have honed new ways to attack furiously. The following effects are now among your Brutal Strike options.\n\nStaggering Blow:\nThe target has Disadvantage on the next saving throw it makes, and it can't make Opportunity Attacks until the start of your next turn.\n\nSundering Blow:\nBefore the start of your next turn, the next attack roll made by another creature against the target gains a +5 bonus to the roll. An attack roll can gain only one Sundering Blow bonus.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisites":""}],"15":[{"id":"Level 15: Persistent Rage_Barbarian","name":"Level 15: Persistent Rage","description":"When you roll Initiative, you can regain all expended uses of Rage. After you regain uses of Rage in this way, you can't do so again until you finish a Long Rest.\n\nIn addition, your Rage is so fierce that it now lasts for 10 minutes without you needing to do anything to extend it from round to round. Your Rage ends early if you have the Unconscious condition (not just the Incapacitated condition) or don Heavy armor.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisites":"","customFields":{"Persistent Rage":{"recovery":{"shortRest":"0","longRest":"1"},"15":1}}}],"16":[{"id":"Level 16: Ability Score Improvement_Barbarian","name":"Level 16: Ability Score Improvement","description":"You gain the Ability Score Improvement feat (see chapter 5) or another feat of your choice for which you qualify. You gain this feature again at Barbarian levels 8, 12, and 16.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisites":""}],"17":[{"id":"Level 17: Improved Brutal Strike_Barbarian","name":"Level 17: Improved Brutal Strike","description":"The extra damage of your Brutal Strike increases to 2d10. In addition. you can use two different Brutal Strike effects whenever you use your Brutal Strike feature.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisites":""}],"18":[{"id":"Level 18: Indomitable Might_Barbarian","name":"Level 18: Indomitable Might","description":"If your total for a Strength check or Strength saving throw is less than your Strength score, you can use that score in place of the total.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisites":""}],"19":[{"id":"Level 19: Epic Boon_Barbarian","name":"Level 19: Epic Boon","description":"You gain an Epic Boon feat (see chapter 5) or another feat of your choice for which you qualify. Boon of Irresistible Offense is recommended.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisites":""}],"20":[{"id":"Level 20: Primal Champion_Barbarian","name":"Level 20: Primal Champion","description":"You embody primal power. Your Strength and Constitution scores increase by 4, to a maximum of 25.\n\nSource:\tPlayer's Handbook 2024 p. 53","type":"Barbarian Class Feature","prerequisites":""}]},"subClasses":{"3":[{"name":"Path Of The Berserker","description":"Channel Rage into Violent Fury\nBarbarians who walk the Path of the Berserker direct their Rage primarily toward violence. Their path is one of untrammeled fury, and they thrill in the chaos of battle as they allow their Rage to seize and empower them.\n\nSource:\tPlayer's Handbook 2024 p. 54","subClassId":"Barbarian_path_of_the_berserker","features":{"3":[{"id":"Level 3: Frenzy (Path Of The Berserker)_Path Of The Berserker","name":"Level 3: Frenzy (Path Of The Berserker)","description":"If you use Reckless Attack while your Rage is active, you deal extra damage to the first target you hit on your turn with a Strength-based attack. To determine the extra damage, roll a number of d6s equal to your Rage Damage bonus, and add them together. The damage has the same type as the weapon or Unarmed Strike used for the attack.\n\nSource:\tPlayer's Handbook 2024 p. 54","type":"Path Of The Berserker Feature","prerequisites":""}],"6":[{"id":"Level 6: Mindless Rage (Path Of The Berserker)_Path Of The Berserker","name":"Level 6: Mindless Rage (Path Of The Berserker)","description":"You have Immunity to the Charmed and Frightened conditions while your Rage is active. If you're Charmed or Frightened when you enter your Rage, the condition ends on you.\n\nSource:\tPlayer's Handbook 2024 p. 54","type":"Path Of The Berserker Feature","prerequisites":""}],"10":[{"id":"Level 10: Retaliation (Path Of The Berserker)_Path Of The Berserker","name":"Level 10: Retaliation (Path Of The Berserker)","description":"When you take damage from a creature that is within 5 feet of you, you can take a Reaction to make one melee attack against that creature, using a weapon or an Unarmed Strike.\n\nSource:\tPlayer's Handbook 2024 p. 54","type":"Path Of The Berserker Feature","prerequisites":""}],"14":[{"id":"Level 14: Intimidating Presence (Path Of The Berserker)_Path Of The Berserker","name":"Level 14: Intimidating Presence (Path Of The Berserker)","description":"As a Bonus Action, you can strike terror into others with your menacing presence and primal power. When you do so, each creature of your choice in a 30-foot Emanation originating from you must make a Wisdom saving throw (DC 8 plus your Strength modifier and Proficiency Bonus). On a failed save, a creature has the Frightened condition for 1 minute. At the end of each of the Frightened creature's turns, the creature repeats the save, ending the effect on itself on a success.\n\nOnce you use this feature, you can't use it again until you finish a Long Rest unless you expend a use of your Rage (no action required) to restore your use of it.\n\nSource:\tPlayer's Handbook 2024 p. 54","type":"Path Of The Berserker Feature","prerequisites":""}]}}]},"selectedSubclassId":null}],"attributes":{"Strength":16,"Dexterity":16,"Constitution":13,"Intelligence":12,"Wisdom":10,"Charisma":8},"attributeModifiers":{"Strength":0,"Dexterity":0,"Constitution":0,"Intelligence":0,"Wisdom":0,"Charisma":0},"image":null,"bio":"Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste Biografia de Teste ","background":{"id":"soldier","name":"Soldier","abilityScores":["Strength","Dexterity","Constitution"],"feat":{"id":"savage_attacker","name":"Savage Attacker","description":"You've trained to deal particularly damaging strikes. Once per turn when you hit a target with a weapon, you can roll the weapon's damage dice twice and use either roll against the target.\n\nSource:\tPlayer's Handbook 2024 p. 201","type":"Feat","prerequisites":""},"skillProficiencies":["Athletics","Intimidation"],"toolProficiency":"Choose one kind of Gaming Set","equipment":["Spear, Shortbow, 20 Arrow, Gaming Set (same as above), Healer's Kit, Quiver, Traveler's Clothes, 14 GP","50 GP"]},"alignment":"Leal e Bom","maxHP":13,"currentHP":13,"temporaryHP":0,"armorClass":0,"speed":"30 ft.","initiative":0,"armorClassModifier":0,"speedModifier":0,"initiativeModifier":0,"proficiencyBonusModifier":0,"proficiencyBonus":2,"languages":["Common","Draconic","Dwarvish"],"weaponProficiencies":["Simple Weapons","Martial Weapons"],"armorShieldProficiencies":["Light Armor","Medium Armor","Shields"],"equipment":[{"id":"greataxe","title":"Greataxe","description":"Heavy: You have Disadvantage on attack rolls with a Heavy weapon if it's a Melee weapon and your Strength score isn't at least 13 or if it's a Ranged weapon and  your Dexterity score isn't at least 13.\n\nTwo-Handed: A Two-Handed weapon requires two hands when you attack with it.\n\nCleave (Mastery): If you hit a creature with a melee attack roll using this weapon, you can make a melee attack roll with the weapon against a second creature within 5 feet of the first that is also within your reach. On a hit, the second creature takes the weapon's damage, but don't add your ability modifier to that damage unless that modifier is negative. You can make this extra attack only once per turn.\n\nProficiency: martial, greataxe\nSource:\tPlayer's Handbook 2024 p. 215","properties":"Martial, Heavy, Two-Handed","equipped":false,"attuned":false,"requiresAttunement":false,"quantity":1,"weight":7.0,"type":"Melee Weapon","hitBonus":null,"damages":{"Slashing":"1d12"},"price":"30 gp","dexToAttack":false,"useAmmo":false,"ammunitionName":null,"martialWeapon":true,"originalDamageFormula":"1d12","ac":null,"stealthDisadvantage":false,"requirements":null,"mastery":"Cleave","rarity":null,"useBothHands":false,"versatileDamage":null},{"id":"handaxe","title":"Handaxe","description":"Light: When you take the Attack action on your turn and. attack with a Light weapon, you can make one extra attack as a Bonus Action later on the same turn. That extra attack must be made with a different Light weapon, and you don't add your ability modifier to the extra attack's damage unless that modifier is negative. For example, you can attack with a Shortsword in one hand and a Dagger in the other using the Attack action and a Bonus Action, but you don't add your Strength or Dexterity modifier to the damage roll of the Bonus Action unless that modifier is negative.\n\nThrown: If a weapon has the Thrown property, you can throw the weapon to make a ranged attack, and you can draw that weapon as part of the attack. If the weapon is a Melee weapon, use the same ability modifier for the attack and damage rolls that you use for a melee attack with that weapon.\n\nVex (Mastery): If you hit a creature with this weapon and deal damage to the creature, you have Advantage on your next attack roll against that creature before the end of your next turn.\n\nProficiency: simple, handaxe\nSource:\tPlayer's Handbook 2024 p. 215","properties":"Light, Thrown, Ranged (20/60)","equipped":false,"attuned":false,"requiresAttunement":false,"quantity":4,"weight":2.0,"type":"Melee Weapon","hitBonus":null,"damages":{"Slashing":"1d6"},"price":"5 gp","dexToAttack":false,"useAmmo":false,"ammunitionName":null,"martialWeapon":true,"originalDamageFormula":"1d6","ac":null,"stealthDisadvantage":false,"requirements":null,"mastery":"Vex","rarity":null,"useBothHands":false,"versatileDamage":null},{"id":"explorer's_pack","title":"Explorer's Pack","description":"An Explorer's Pack contains the following items: Backpack, Bedroll, 2 flasks of Oil, 10 days of Rations, Rope, Tinderbox, 10 Torches, and Waterskin.\n\nSource:\tPlayer's Handbook 2024 p. 225","properties":"","equipped":false,"attuned":false,"requiresAttunement":false,"quantity":1,"weight":55.0,"type":"Gear","hitBonus":null,"damages":{},"price":"10 gp","dexToAttack":false,"useAmmo":false,"ammunitionName":null,"martialWeapon":false,"originalDamageFormula":"","ac":null,"stealthDisadvantage":false,"requirements":null,"mastery":null,"rarity":null,"useBothHands":false,"versatileDamage":null},{"id":"spear","title":"Spear","description":"Thrown: If a weapon has the Thrown property, you can throw the weapon to make a ranged attack, and you can draw that weapon as part of the attack. If the weapon is a Melee weapon, use the same ability modifier for the attack and damage rolls that you use for a melee attack with that weapon.\n\nVersatile: A Versatile weapon can be used with one or two hands. A damage value in parentheses appears with the property. The weapon deals that damage when used with two hands to make a melee attack.\n\nSap (Mastery): If you hit a creature with this weapon, that creature has Disadvantage on its next attack roll before the start of your next turn.\n\nProficiency: simple, spear\nSource:\tPlayer's Handbook 2024 p. 215","properties":"Thrown, Versatile, Ranged (20/60)","equipped":false,"attuned":false,"requiresAttunement":false,"quantity":1,"weight":3.0,"type":"Melee Weapon","hitBonus":null,"damages":{"Piercing":"1d6"},"price":"1 gp","dexToAttack":false,"useAmmo":false,"ammunitionName":null,"martialWeapon":true,"originalDamageFormula":"1d6","ac":null,"stealthDisadvantage":false,"requirements":null,"mastery":"Sap","rarity":null,"useBothHands":false,"versatileDamage":"1d8"},{"id":"shortbow","title":"Shortbow","description":"Ammunition: You can use a weapon that has the Ammunition property to make a ranged attack only if you have ammunition to fire from it. The type of ammunition required is specified with the weapon's range. Each attack expends one piece of Ammunition: Drawing the ammunition is part of the attack (you need a free hand to load a one-handed weapon). After a fight, you can spend 1 minute to recover half the ammunition (round down) you used in the fight; the rest is lost.\n\nTwo-Handed: A Two-Handed weapon requires two hands when you attack with it.\n\nVex (Mastery): If you hit a creature with this weapon and deal damage to the creature, you have Advantage on your next attack roll against that creature before the end of your next turn.\n\nProficiency: simple, shortbow\nSource:\tPlayer's Handbook 2024 p. 215","properties":"Ammunition, Two-Handed, Ranged (80/320)","equipped":false,"attuned":false,"requiresAttunement":false,"quantity":1,"weight":2.0,"type":"Ranged Weapon","hitBonus":null,"damages":{"Piercing":"1d6"},"price":"25 gp","dexToAttack":false,"useAmmo":true,"ammunitionName":"Arrow","martialWeapon":false,"originalDamageFormula":"1d6","ac":null,"stealthDisadvantage":false,"requirements":null,"mastery":"Vex","rarity":null,"useBothHands":false,"versatileDamage":null},{"id":"1742819394754","title":"Arrow","description":"","properties":"","equipped":false,"attuned":false,"requiresAttunement":false,"quantity":20,"weight":0.0,"type":"Other","hitBonus":null,"damages":{},"price":null,"dexToAttack":false,"useAmmo":false,"ammunitionName":null,"martialWeapon":false,"originalDamageFormula":null,"ac":null,"stealthDisadvantage":false,"requirements":null,"mastery":null,"rarity":null,"useBothHands":false,"versatileDamage":null},{"id":"1742819394898","title":"Gaming Set (same as above)","description":"","properties":"","equipped":false,"attuned":false,"requiresAttunement":false,"quantity":1,"weight":0.0,"type":"Other","hitBonus":null,"damages":{},"price":null,"dexToAttack":false,"useAmmo":false,"ammunitionName":null,"martialWeapon":false,"originalDamageFormula":null,"ac":null,"stealthDisadvantage":false,"requirements":null,"mastery":null,"rarity":null,"useBothHands":false,"versatileDamage":null},{"id":"healer's_kit","title":"Healer's Kit","description":"A Healer's Kit has ten uses. As a Utilize action, you can expend one of its uses to stabilize an Unconscious creature that has 0 Hit Points without needing to make a Wisdom (Medicine) check.\n\nSource:\tPlayer's Handbook 2024 p. 225","properties":"","equipped":false,"attuned":false,"requiresAttunement":false,"quantity":1,"weight":3.0,"type":"Gear","hitBonus":null,"damages":{},"price":"5 gp","dexToAttack":false,"useAmmo":false,"ammunitionName":null,"martialWeapon":false,"originalDamageFormula":"","ac":null,"stealthDisadvantage":false,"requirements":null,"mastery":null,"rarity":null,"useBothHands":false,"versatileDamage":null},{"id":"quiver","title":"Quiver","description":"A Quiver holds up to 20 Arrow.\n\nSource:\tPlayer's Handbook 2024 p. 228","properties":"","equipped":false,"attuned":false,"requiresAttunement":false,"quantity":1,"weight":1.0,"type":"Gear","hitBonus":null,"damages":{},"price":"1 gp","dexToAttack":false,"useAmmo":false,"ammunitionName":null,"martialWeapon":false,"originalDamageFormula":"","ac":null,"stealthDisadvantage":false,"requirements":null,"mastery":null,"rarity":null,"useBothHands":false,"versatileDamage":null},{"id":"1742819395099","title":"Traveler's Clothes","description":"","properties":"","equipped":false,"attuned":false,"requiresAttunement":false,"quantity":1,"weight":0.0,"type":"Other","hitBonus":null,"damages":{},"price":null,"dexToAttack":false,"useAmmo":false,"ammunitionName":null,"martialWeapon":false,"originalDamageFormula":null,"ac":null,"stealthDisadvantage":false,"requirements":null,"mastery":null,"rarity":null,"useBothHands":false,"versatileDamage":null}],"featuresAndTraits":[{"id":"savage_attacker","name":"Savage Attacker","description":"You've trained to deal particularly damaging strikes. Once per turn when you hit a target with a weapon, you can roll the weapon's damage dice twice and use either roll against the target.\n\nSource:\tPlayer's Handbook 2024 p. 201","type":"Feat","prerequisites":""},{"id":"Barbarian_Barbarian","name":"Barbarian","description":"Barbarians are mighty warriors who are powered by primal forces of the multiverse that manifest as a Rage. More than a mere emotion—and not limited to anger—this Rage is an incarnation of a predator's ferocity, a storm's fury, and a sea's turmoil.\n\nSome Barbarians personify their Rage as a fierce spirit or revered forebear. Others see it as a connection to the pain and anguish of the world, as an impersonal tangle of wild magic, or as an expression of their own deepest self. For every Barbarian, their Rage is a power that fuels not just battle prowess, but also uncanny reflexes and heightened senses.\n\nBarbarians often serve as protectors and leaders in their communities. They charge headlong into danger so those under their protection don't have to. Their courage in the face of danger makes Barbarians perfectly suited for adventure.\n\nSource:\tPlayer's Handbook 2024 p. 51","type":"Barbarian Class Feature","prerequisites":""},{"id":"Level 1: Rage_Barbarian","name":"Level 1: Rage","description":"You can imbue yourself with a primal power called Rage, a force that grants you extraordinary might and resilience. You can enter it as a Bonus Action if you aren't wearing Heavy armor.\n\nYou can enter your Rage the number of times shown for your Barbarian level in the Rages column of the Barbarian Features table. You regain one expended use when you finish a Short Rest, and you regain all expended uses when you finish a Long Rest.\n\nWhile active, your Rage follows the rules below.\n\nDamage Resistance:\nYou have Resistance to Bludgeoning, Piercing, and Slashing damage.\n\nRage Damage:\nWhen you make an attack using Strength- with either a weapon or an Unarmed Strike- and deal damage to the target, you gain a bonus to the damage that increases as you gain levels as a Barbarian, as shown in the Rage Damage column of the Barbarian Features table (+2 at 1st level, +3 at 9th level, +4 at 16th level).\n\nStrength Advantage:\nYou have Advantage on Strength checks and Strength saving throws.\n\nNo Concentration or Spells:\nYou can't maintain Concentration, and you can't cast spells.\n\nDuration:\nThe Rage lasts until the end of your next turn, and it ends early if you don Heavy armor or have the Incapacitated condition. If your Rage is still active on your next turn, you can extend the Rage for another round by doing one of the following:\n\n\t• Make an attack roll against an enemy.\n\t• Force an enemy to make a saving throw.\n\t• Take a Bonus Action to extend your Rage.\n\nEach time the Rage is extended, it lasts until the end of your next turn. You can maintain a Rage for up to 10 minutes.\n\nSource:\tPlayer's Handbook 2024 p. 51","type":"Barbarian Class Feature","prerequisites":"","customFields":{"Rage":{"recovery":{"shortRest":"0","longRest":"1"},"1":2,"3":3,"6":4,"12":5,"17":6}}},{"id":"Level 1: Unarmored Defense_Barbarian","name":"Level 1: Unarmored Defense","description":"While you aren't wearing any armor, your base Armor Class equals 10 plus your Dexterity and Constitution modifiers. You can use a Shield and still gain this benefit.\n\nSource:\tPlayer's Handbook 2024 p. 51","type":"Barbarian Class Feature","prerequisites":""},{"id":"Level 1: Weapon Mastery_Barbarian","name":"Level 1: Weapon Mastery","description":"Your training with weapons allows you to use the mastery properties of two kinds of Simple or Martial Melee weapons of your choice, such as Greataxes and Handaxes. Whenever you finish a Long Rest, you can practice weapon drills and change one of those weapon choices.\n\nWhen you reach certain Barbarian levels, you gain the ability to use the mastery properties of more kinds of weapons, as shown in the Weapon Mastery column of the Barbarian Features table. (2 at level 2, 3 at level 4, 4 at level 10)\n\nSource:\tPlayer's Handbook 2024 p. 52","type":"Barbarian Class Feature","prerequisites":""}],"spells":[],"spellSlots":{},"spentCustomFields":{"Rage":{"1":0}},"skillProficiencies":{"Athletics":true,"Intimidation":true,"Nature":false,"Perception":true,"Survival":true,"Strength":true,"Constitution":true},"skillExpertise":{},"skillModifiers":{},"hitDice":"1d12","xp":0,"hitDiceSpent":"","maxCarryingWeight":0.0,"size":"Medium","copperPieces":0,"silverPieces":0,"electrumPieces":0,"goldPieces":29,"platinumPieces":0,"conditions":[],"isNPC":false,"type":"Humanoid","cr":0.0,"vulnerabilities":[],"resistances":[],"immunities":[],"saves":[]}